{
  "catalog": {
    "uuid": "b14571cd-e300-4928-9226-d05db6ecc4c7",
    "metadata": {
      "title": "PCI DSS v4.0",
      "last-modified": "2023-06-22T04:09:26.264052+00:00",
      "version": "1.2.0",
      "oscal-version": "1.0.2"
    },
    "groups": [
      {
        "id": "PCI-1",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "1"
          }
        ],
        "groups": [
          {
            "id": "PCI-1.1",
            "title": "Processes and mechanisms for installing and maintaining network security controls are defined and understood.",
            "props": [
              {
                "name": "label",
                "value": "1.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-1.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.1.1_smt",
                    "name": "statement",
                    "prose": "All security policies and operational procedures that are identified in Requirement 1 are: \n* Documented. \n* Kept up to date. \n* In use. \n* Known to all affected parties."
                  },
                  {
                    "id": "PCI-1.1.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "1.1.1 Examine documentation and interview personnel to verify that security policies and operational procedures identified in Requirement 1 are managed in accordance with all elements specified in this requirement."
                  },
                  {
                    "id": "PCI-1.1.1_gdn",
                    "name": "guidance",
                    "prose": "Roles and responsibilities may be documented within policies and procedures or maintained within separate documents. As part of communicating roles and responsibilities, entities can consider having personnel acknowledge their acceptance and understanding of their assigned roles and responsibilities."
                  }
                ]
              },
              {
                "id": "PCI-1.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.1.2_smt",
                    "name": "statement",
                    "prose": "Roles and responsibilities for performing activities in Requirement 1 are documented, assigned, and understood"
                  },
                  {
                    "id": "PCI-1.1.2_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine documentation to verify that descriptions of roles and responsibilities for performing activities in Requirement 1 are documented and assigned.\nInterview personnel responsible for performing activities in Requirement 1 to verify that roles and responsibilities are assigned as documented and are understood."
                  },
                  {
                    "id": "PCI-1.1.2_gdn",
                    "name": "guidance",
                    "prose": "Roles and responsibilities may be documented within policies and procedures or maintained within separate documents. As part of communicating roles and responsibilities, entities can consider having personnel acknowledge their acceptance and understanding of their assigned roles and responsibilities."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-1.2",
            "title": "Network security controls (NSCs) are configured and maintained.",
            "props": [
              {
                "name": "label",
                "value": "1.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-1.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.2.1_smt",
                    "name": "statement",
                    "prose": "Configuration standards for NSC rulesets are: \n* Defined. \n* Implemented. \n* Maintained."
                  },
                  {
                    "id": "PCI-1.2.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine the configuration standards for NSC rulesets to verify the standards are in accordance with all elements specified in this requirement.\nExamine configuration settings for NSC rulesets to verify that rulesets are implemented according to the configuration standards."
                  },
                  {
                    "id": "PCI-1.2.1_gdn",
                    "name": "guidance",
                    "prose": "These standards often define the requirements for acceptable protocols, ports that are permitted to be used, and specific configuration requirements that are acceptable. Configuration standards may also outline what the entity considers not acceptable or not permitted within its network."
                  }
                ]
              },
              {
                "id": "PCI-1.2.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.2.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.2.2_smt",
                    "name": "statement",
                    "prose": "All changes to network connections and to configurations of NSCs are approved and managed in accordance with the change control process defined at Requirement 6.5.1."
                  },
                  {
                    "id": "PCI-1.2.2_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine documented procedures to verify that changes to network connections and configurations of NSCs are included in the formal change control process in accordance with Requirement 6.5.1.\nExamine network configuration settings to identify changes made to network connections. Interview responsible personnel and examine change control records to verify that identified changes to network connections were approved and managed in accordance with Requirement 6.5.1.\nExamine network configuration settings to identify changes made to configurations of NSCs. Interview responsible personnel and examine change control records to verify that identified changes to configurations of NSCs were approved and managed in accordance with Requirement 6.5.1."
                  },
                  {
                    "id": "PCI-1.2.2_gdn",
                    "name": "guidance",
                    "prose": "Changes should be approved by individuals with the appropriate authority and knowledge to understand the impact of the change. Verification should provide reasonable assurance that the change did not adversely impact the security of the network and that the change performs as expected. To avoid having to address security issues introduced by a change, all changes should be approved prior to being implemented and verified after the change is implemented. Once approved and verified, network documentation should be updated to include the changes to prevent inconsistencies between network documentation and the actual configuration."
                  }
                ]
              },
              {
                "id": "PCI-1.2.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.2.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.2.3_smt",
                    "name": "statement",
                    "prose": "An accurate network diagram(s) is maintained that shows all connections between the CDE and other networks, including any wireless networks."
                  },
                  {
                    "id": "PCI-1.2.3_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine diagram(s) and network configurations to verify that an accurate network diagram(s) exists in accordance with all elements specified in this requirement.\nExamine documentation and interview responsible personnel to verify that the network diagram(s) is accurate and updated when there are changes to the environment."
                  },
                  {
                    "id": "PCI-1.2.3_gdn",
                    "name": "guidance",
                    "prose": "All connections to and from the CDE should be identified, including systems providing security, management, or maintenance services to CDE system components. Entities should consider including the following in their network diagrams: \n* All locations, including retail locations, data centers, corporate locations, cloud providers, etc. \n* Clear labeling of all network segments. \n* All security controls providing segmentation, including unique identifiers for each control (for example, name of control, make, model, and version). \n* All in-scope system components, including NSCs, web app firewalls, anti-malware solutions, change management solutions, IDS/IPS, log aggregation systems, payment terminals, payment applications, HSMs, etc. \n* Clear labeling of any out-of-scope areas on the diagram via a shaded box or other mechanism. \n* Date of last update, and names of people that made and approved the updates. \n* A legend or key to explain the diagram. Diagrams should be updated by authorized personnel to ensure diagrams continue to provide an accurate description of the network."
                  }
                ]
              },
              {
                "id": "PCI-1.2.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.2.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.2.4_smt",
                    "name": "statement",
                    "prose": "An accurate data-flow diagram(s) is maintained that meets the following: \n* Shows all account data flows across systems and networks. \n* Updated as needed upon changes to the environment."
                  },
                  {
                    "id": "PCI-1.2.4_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine data-flow diagram(s) and interview personnel to verify the diagram(s) show all account data flows in accordance with all elements specified in this requirement.\nExamine documentation and interview responsible personnel to verify that the data-flow diagram(s) is accurate and updated when there are changes to the environment."
                  },
                  {
                    "id": "PCI-1.2.4_gdn",
                    "name": "guidance",
                    "prose": "The data-flow diagram should include all connection points where account data is received into and sent out of the network, including connections to open, public networks, application processing flows, storage, transmissions between systems and networks, and file backups. The data-flow diagram is meant to be in addition to the network diagram and should reconcile with and augment the network diagram. As a best practice, entities can consider including the following in their data-flow diagrams: \n* All processing flows of account data, including authorization, capture, settlement, chargeback, and refunds. \n* All distinct acceptance channels, including card-present, card-not-present, and e- commerce. \n* All types of data receipt or transmission, including any involving hard copy/paper media. \n* The flow of account data from the point where it enters the environment, to its final disposition. \n* Where account data is transmitted and processed, where it is stored, and whether storage is short term or long term. \n* The source of all account data received (for example, customers, third party, etc.), and any entities with which account data is shared. \n* Date of last update, and names of people that made and approved the updates."
                  }
                ]
              },
              {
                "id": "PCI-1.2.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.2.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.2.5_smt",
                    "name": "statement",
                    "prose": "All services, protocols, and ports allowed are identified, approved, and have a defined business need."
                  },
                  {
                    "id": "PCI-1.2.5_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine documentation to verify that a list exists of all allowed services, protocols, and ports, including business justification and approval for each.\nExamine configuration settings for NSCs to verify that only approved services, protocols, and ports are in use."
                  },
                  {
                    "id": "PCI-1.2.5_gdn",
                    "name": "guidance",
                    "prose": "The security risk associated with each service, protocol, and port allowed should be understood. Approvals should be granted by personnel independent of those managing the configuration. Approving personnel should possess knowledge and accountability appropriate for making approval decisions."
                  }
                ]
              },
              {
                "id": "PCI-1.2.6",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.2.6"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.2.6_smt",
                    "name": "statement",
                    "prose": "Security features are defined and implemented for all services, protocols, and ports that are in use and considered to be insecure, such that the risk is mitigated."
                  },
                  {
                    "id": "PCI-1.2.6_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine documentation that identifies all insecure services, protocols, and ports in use to verify that for each, security features are defined to mitigate the risk.\nExamine configuration settings for NSCs to verify that the defined security features are implemented for each identified insecure service, protocol, and port."
                  },
                  {
                    "id": "PCI-1.2.6_gdn",
                    "name": "guidance",
                    "prose": "If insecure services, protocols, or ports are necessary for business, the risk posed by these services, protocols, and ports should be clearly understood and accepted by the organization, the use of the service, protocol, or port should be justified, and the security features that mitigate the risk of using these services, protocols, and ports should be defined and implemented by the entity."
                  }
                ]
              },
              {
                "id": "PCI-1.2.7",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.2.7"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.2.7_smt",
                    "name": "statement",
                    "prose": "Configurations of NSCs are reviewed at least once every six months to confirm they are relevant and effective."
                  },
                  {
                    "id": "PCI-1.2.7_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine documentation to verify procedures are defined for reviewing configurations of NSCs at least once every six months.\nExamine documentation of reviews of configurations for NSCs and interview responsible personnel to verify that reviews occur at least once every six months.\nExamine configurations for NSCs to verify that configurations identified as no longer being supported by a business justification are removed or updated."
                  },
                  {
                    "id": "PCI-1.2.7_gdn",
                    "name": "guidance",
                    "prose": "This review, which can be implemented using manual, automated, or system-based methods, is intended to confirm that the settings that manage traffic rules, what is allowed in and out of the network, match the approved configurations. The review should provide confirmation that all permitted access has a justified business reason. Any discrepancies or uncertainties about a rule or configuration should be escalated for resolution. While this requirement specifies that this review occur at least once every six months, organizations with a high volume of changes to their network configurations may wish to consider performing reviews more frequently to ensure that the configurations continue to meet the needs of the business."
                  }
                ]
              },
              {
                "id": "PCI-1.2.8",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.2.8"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.2.8_smt",
                    "name": "statement",
                    "prose": "Configuration files for NSCs are: \n* Secured from unauthorized access. \n* Kept consistent with active network configurations."
                  },
                  {
                    "id": "PCI-1.2.8_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "1.2.8 Examine configuration files for NSCs to verify they are in accordance with all elements specified in this requirement."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-1.3",
            "title": "Network access to and from the cardholder data environment is restricted.",
            "props": [
              {
                "name": "label",
                "value": "1.3"
              }
            ],
            "controls": [
              {
                "id": "PCI-1.3.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.3.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.3.1_smt",
                    "name": "statement",
                    "prose": "Inbound traffic to the CDE is restricted as follows: \n* To only traffic that is necessary. \n* All other traffic is specifically denied."
                  },
                  {
                    "id": "PCI-1.3.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine configuration standards for NSCs to verify that they define restricting inbound traffic to the CDE is in accordance with all elements specified in this requirement.\nExamine configurations of NSCs to verify that inbound traffic to the CDE is restricted in accordance with all elements specified in this requirement."
                  },
                  {
                    "id": "PCI-1.3.1_gdn",
                    "name": "guidance",
                    "prose": "All traffic inbound to the CDE, regardless of where it originates, should be evaluated to ensure it follows established, authorized rules. Connections should be inspected to ensure traffic is restricted to only authorized communications—for example, by restricting source/destination addresses and ports, and blocking of content."
                  }
                ]
              },
              {
                "id": "PCI-1.3.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.3.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.3.2_smt",
                    "name": "statement",
                    "prose": "Outbound traffic from the CDE is restricted as follows: \n* To only traffic that is necessary. \n* All other traffic is specifically denied."
                  },
                  {
                    "id": "PCI-1.3.2_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine configuration standards for NSCs to verify that they define restricting outbound traffic from the CDE in accordance with all elements specified in this requirement.\nExamine configurations of NSCs to verify that outbound traffic from the CDE is restricted in accordance with all elements specified in this requirement."
                  },
                  {
                    "id": "PCI-1.3.2_gdn",
                    "name": "guidance",
                    "prose": "All traffic outbound from the CDE, regardless of the destination, should be evaluated to ensure it follows established, authorized rules. Connections should be inspected to restrict traffic to only authorized communications—for example, by restricting source/destination addresses and ports, and blocking of content."
                  }
                ]
              },
              {
                "id": "PCI-1.3.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.3.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.3.3_smt",
                    "name": "statement",
                    "prose": "NSCs are installed between all wireless networks and the CDE, regardless of whether the wireless network is a CDE, such that: \n* All wireless traffic from wireless networks into the CDE is denied by default. \n* Only wireless traffic with an authorized business purpose is allowed into the CDE."
                  },
                  {
                    "id": "PCI-1.3.3_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "1.3.3 Examine configuration settings and network diagrams to verify that NSCs are implemented between all wireless networks and the CDE, in accordance with all elements specified in this requirement."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-1.4",
            "title": "Network connections between trusted and untrusted networks are controlled.",
            "props": [
              {
                "name": "label",
                "value": "1.4"
              }
            ],
            "controls": [
              {
                "id": "PCI-1.4.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.4.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.4.1_smt",
                    "name": "statement",
                    "prose": "NSCs are implemented between trusted and untrusted networks"
                  },
                  {
                    "id": "PCI-1.4.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine configuration standards and network diagrams to verify that NSCs are defined between trusted and untrusted networks.\nExamine network configurations to verify that NSCs are in place between trusted and untrusted networks, in accordance with the documented configuration standards and network diagrams."
                  }
                ]
              },
              {
                "id": "PCI-1.4.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.4.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.4.2_smt",
                    "name": "statement",
                    "prose": "Inbound traffic from untrusted networks to trusted networks is restricted to: \n* Communications with system components that are authorized to provide publicly accessible services, protocols, and ports. \n* Stateful responses to communications initiated by system components in a trusted network. \n* All other traffic is denied."
                  },
                  {
                    "id": "PCI-1.4.2_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "1.4.2 Examine vendor documentation and configurations of NSCs to verify that inbound traffic from untrusted networks to trusted networks is restricted in accordance with all elements specified in this requirement."
                  },
                  {
                    "id": "PCI-1.4.2_gdn",
                    "name": "guidance",
                    "prose": "System components that provide publicly accessible services, such as email, web, and DNS servers, are the most vulnerable to threats originating from untrusted networks. Ideally, such systems are placed within a dedicated trusted network that is public facing (for example, a DMZ) but that is separated via NSCs from more sensitive internal systems, which helps protect the rest of the network in the event these externally accessible systems are compromised. This functionality is intended to prevent malicious actors from accessing the organization's internal network from the Internet, or from using services, protocols, or ports in an unauthorized manner. Where this functionality is provided as a built-in feature of an NSC, the entity should ensure that its configurations do not result in the functionality being disabled or bypassed."
                  }
                ]
              },
              {
                "id": "PCI-1.4.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.4.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.4.3_smt",
                    "name": "statement",
                    "prose": "Anti-spoofing measures are implemented to detect and block forged source IP addresses from entering the trusted network."
                  },
                  {
                    "id": "PCI-1.4.3_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "1.4.3 Examine vendor documentation and configurations for NSCs to verify that anti-spoofing measures are implemented to detect and block forged source IP addresses from entering the trusted network."
                  },
                  {
                    "id": "PCI-1.4.3_gdn",
                    "name": "guidance",
                    "prose": "Products usually come with anti-spoofing set as a default and may not be configurable. Entities should consult the vendor's documentation for more information."
                  }
                ]
              },
              {
                "id": "PCI-1.4.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.4.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.4.4_smt",
                    "name": "statement",
                    "prose": "System components that store cardholder data are not directly accessible from untrusted networks."
                  },
                  {
                    "id": "PCI-1.4.4_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine the data-flow diagram and network diagram to verify that it is documented that system components storing cardholder data are not directly accessible from the untrusted networks.\nExamine configurations of NSCs to verify that controls are implemented such that system components storing cardholder data are not directly accessible from untrusted networks."
                  }
                ]
              },
              {
                "id": "PCI-1.4.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.4.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.4.5_smt",
                    "name": "statement",
                    "prose": "The disclosure of internal IP addresses and routing information is limited to only authorized parties."
                  },
                  {
                    "id": "PCI-1.4.5_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine configurations of NSCs to verify that the disclosure of internal IP addresses and routing information is limited to only authorized parties.\nInterview personnel and examine documentation to verify that controls are implemented such that any disclosure of internal IP addresses and routing information is limited to only authorized parties."
                  },
                  {
                    "id": "PCI-1.4.5_gdn",
                    "name": "guidance",
                    "prose": "Methods used to meet the intent of this requirement may vary, depending on the specific networking technology being used. For example, the controls used to meet this requirement may be different for IPv4 networks than for IPv6 networks."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-1.5",
            "title": "Risks to the CDE from computing devices that are able to connect to both untrusted networks and the CDE are mitigated.",
            "props": [
              {
                "name": "label",
                "value": "1.5"
              }
            ],
            "controls": [
              {
                "id": "PCI-1.5.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "1.5.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-1.5.1_smt",
                    "name": "statement",
                    "prose": "Security controls are implemented on any computing devices, including company\n    * and employee-owned devices, that connect to both untrusted networks (including the Internet) and the CDE as follows: \n* Specific configuration settings are defined to prevent threats being introduced into the entity’s network. \n* Security controls are actively running. \n* Security controls are not alterable by users of the computing devices unless specifically documented and authorized by management on a case-by-case basis for a limited period."
                  },
                  {
                    "id": "PCI-1.5.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine policies and configuration standards and interview personnel to verify security controls for computing devices that connect to both untrusted networks, and the CDE, are implemented in accordance with all elements specified in this requirement.\nExamine configuration settings on computing devices that connect to both untrusted networks and the CDE to verify settings are implemented in accordance with all elements specified in this requirement."
                  },
                  {
                    "id": "PCI-1.5.1_gdn",
                    "name": "guidance",
                    "prose": "The specific configuration settings are determined by the entity and should be consistent with its network security policies and procedures. Where there is a legitimate need to temporarily disable security controls on a company-owned or employee-owned device that connects to both an untrusted network and the CDE—for example, to support a specific maintenance activity or investigation of a technical problem—the reason for taking such action is understood and approved by an appropriate management representative. Any disabling or altering of these security controls, including on administrators’ own devices, is performed by authorized personnel. It is recognized that administrators have privileges that may allow them to disable security controls on their own computers, but there should be alerting mechanisms in place when such controls are disabled and follow up that occurs to ensure processes were followed."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-10",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "10"
          }
        ],
        "groups": [
          {
            "id": "PCI-10.1",
            "title": "Processes and mechanisms for logging and monitoring all access to system components and cardholder data are defined and documented.",
            "props": [
              {
                "name": "label",
                "value": "10.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-10.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.1.1_smt",
                    "name": "statement",
                    "prose": "All security policies and operational procedures that are identified in Requirement 10 are: \n* Documented. \n* Kept up to date. \n* In use. \n* Known to all affected parties."
                  }
                ]
              },
              {
                "id": "PCI-10.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.1.2_smt",
                    "name": "statement",
                    "prose": "Roles and responsibilities for performing activities in Requirement 10 are documented, assigned, and understood."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-10.2",
            "title": "Audit logs are implemented to support the detection of anomalies and suspicious activity, and the forensic analysis of events.",
            "props": [
              {
                "name": "label",
                "value": "10.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-10.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.2.1_smt",
                    "name": "statement",
                    "prose": "Audit logs are enabled and active for all system components and cardholder data."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-10.2.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "10.2.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-10.2.1.1_smt",
                        "name": "statement",
                        "prose": "Audit logs capture all individual user access to cardholder data."
                      }
                    ]
                  },
                  {
                    "id": "PCI-10.2.1.2",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "10.2.1.2"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-10.2.1.2_smt",
                        "name": "statement",
                        "prose": "Audit logs capture all actions taken by any individual with administrative access, including any interactive use of application or system accounts."
                      }
                    ]
                  },
                  {
                    "id": "PCI-10.2.1.3",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "10.2.1.3"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-10.2.1.3_smt",
                        "name": "statement",
                        "prose": "Audit logs capture all access to audit logs."
                      }
                    ]
                  },
                  {
                    "id": "PCI-10.2.1.4",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "10.2.1.4"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-10.2.1.4_smt",
                        "name": "statement",
                        "prose": "Audit logs capture all invalid logical access attempts."
                      }
                    ]
                  },
                  {
                    "id": "PCI-10.2.1.5",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "10.2.1.5"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-10.2.1.5_smt",
                        "name": "statement",
                        "prose": "Audit logs capture all changes to identification and authentication credentials including, but not limited to: \n* Creation of new accounts. \n* Elevation of privileges. \n* All changes, additions, or deletions to accounts with administrative access."
                      }
                    ]
                  },
                  {
                    "id": "PCI-10.2.1.6",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "10.2.1.6"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-10.2.1.6_smt",
                        "name": "statement",
                        "prose": "Audit logs capture the following: \n* All initialization of new audit logs, and \n* All starting, stopping, or pausing of the existing audit logs."
                      }
                    ]
                  },
                  {
                    "id": "PCI-10.2.1.7",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "10.2.1.7"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-10.2.1.7_smt",
                        "name": "statement",
                        "prose": "Audit logs capture all creation and deletion of system-level objects."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-10.2.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.2.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.2.2_smt",
                    "name": "statement",
                    "prose": "Audit logs record the following details for each auditable event: \n* User identification. \n* Type of event. \n* Date and time. \n* Success and failure indication. \n* Origination of event. \n* Identity or name of affected data, system component, resource, or service (for example, name and protocol)."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-10.3",
            "title": "Audit logs are protected from destruction and unauthorized modifications.",
            "props": [
              {
                "name": "label",
                "value": "10.3"
              }
            ],
            "controls": [
              {
                "id": "PCI-10.3.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.3.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.3.1_smt",
                    "name": "statement",
                    "prose": "Read access to audit logs files is limited to those with a job-related need."
                  }
                ]
              },
              {
                "id": "PCI-10.3.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.3.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.3.2_smt",
                    "name": "statement",
                    "prose": "Audit log files are protected to prevent modifications by individuals."
                  }
                ]
              },
              {
                "id": "PCI-10.3.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.3.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.3.3_smt",
                    "name": "statement",
                    "prose": "Audit log files, including those for externalfacing technologies, are promptly backed up to a secure, central, internal log server(s) or other media that is difficult to modify."
                  }
                ]
              },
              {
                "id": "PCI-10.3.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.3.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.3.4_smt",
                    "name": "statement",
                    "prose": "File integrity monitoring or change-detection mechanisms is used on audit logs to ensure that existing log data cannot be changed without generating alerts."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-10.4",
            "title": "Audit logs are reviewed to identify anomalies or suspicious activity.",
            "props": [
              {
                "name": "label",
                "value": "10.4"
              }
            ],
            "controls": [
              {
                "id": "PCI-10.4.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.4.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.4.1_smt",
                    "name": "statement",
                    "prose": "The following audit logs are reviewed at least once daily: \n* All security events. \n* Logs of all system components that store, process, or transmit CHD and/or SAD. \n* Logs of all critical system components. \n* Logs of all servers and system components that perform security functions (for example, network security controls, intrusion-detection systems/intrusion-prevention systems (IDS/IPS), authentication servers)."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-10.4.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "10.4.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-10.4.1.1_smt",
                        "name": "statement",
                        "prose": "Automated mechanisms are used to perform audit log reviews."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-10.4.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.4.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.4.2_smt",
                    "name": "statement",
                    "prose": "Logs of all other system components (those not specified in Requirement 10.4.1) are reviewed periodically."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-10.4.2.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "10.4.2.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-10.4.2.1_smt",
                        "name": "statement",
                        "prose": "The frequency of periodic log reviews for all other system components (not defined in Requirement 10.4.1) is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1"
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-10.4.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.4.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.4.3_smt",
                    "name": "statement",
                    "prose": "Exceptions and anomalies identified during the review process are addressed."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-10.5",
            "title": "Audit log history is retained and available for analysis.",
            "props": [
              {
                "name": "label",
                "value": "10.5"
              }
            ],
            "controls": [
              {
                "id": "PCI-10.5.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.5.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.5.1_smt",
                    "name": "statement",
                    "prose": "Retain audit log history for at least 12 months, with at least the most recent three months immediately available for analysis."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-10.6",
            "title": "Time-synchronization mechanisms support consistent time settings across all systems.",
            "props": [
              {
                "name": "label",
                "value": "10.6"
              }
            ],
            "controls": [
              {
                "id": "PCI-10.6.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.6.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.6.1_smt",
                    "name": "statement",
                    "prose": "System clocks and time are synchronized using time-synchronization technology."
                  }
                ]
              },
              {
                "id": "PCI-10.6.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.6.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.6.2_smt",
                    "name": "statement",
                    "prose": "Systems are configured to the correct and consistent time as follows: \n* One or more designated time servers are in use. \n* Only the designated central time server(s) receives time from external sources. \n* Time received from external sources is based on International Atomic Time or Coordinated Universal Time (UTC). \n* The designated time server(s) accept time updates only from specific industry-accepted external sources. \n* Where there is more than one designated time server, the time servers peer with one another to keep accurate time. \n* Internal systems receive time information only from designated central time server(s)."
                  }
                ]
              },
              {
                "id": "PCI-10.6.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.6.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.6.3_smt",
                    "name": "statement",
                    "prose": "Time synchronization settings and data are protected as follows: \n* Access to time data is restricted to only personnel with a business need. \n* Any changes to time settings on critical systems are logged, monitored, and reviewed."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-10.7",
            "title": "Failures of critical security control systems are detected, reported, and responded to promptly.",
            "props": [
              {
                "name": "label",
                "value": "10.7"
              }
            ],
            "controls": [
              {
                "id": "PCI-10.7.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.7.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.7.1_smt",
                    "name": "statement",
                    "prose": "Additional requirement for service providers only: Failures of critical security control systems are detected, alerted, and addressed promptly, including but not limited to failure of the following critical security control systems: \n* Network security controls. \n* IDS/IPS. \n* FIM. \n* Anti-malware solutions. \n* Physical access controls. \n* Logical access controls. \n* Audit logging mechanisms. \n* Segmentation controls (if used)."
                  }
                ]
              },
              {
                "id": "PCI-10.7.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.7.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.7.2_smt",
                    "name": "statement",
                    "prose": "Failures of critical security control systems are detected, alerted, and addressed promptly, including but not limited to failure of the following critical security control systems: \n* Network security controls. \n* IDS/IPS. \n* Change-detection mechanisms. \n* Anti-malware solutions. \n* Physical access controls. \n* Logical access controls. \n* Audit logging mechanisms. \n* Segmentation controls (if used). \n* Audit log review mechanisms. \n* Automated security testing tools (if used)."
                  }
                ]
              },
              {
                "id": "PCI-10.7.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "10.7.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-10.7.3_smt",
                    "name": "statement",
                    "prose": "Failures of any critical security controls systems are responded to promptly, including but not limited to: \n* Restoring security functions. \n* Identifying and documenting the duration (date and time from start to end) of the security failure. \n* Identifying and documenting the cause(s) of failure and documenting required remediation. \n* Identifying and addressing any security issues that arose during the failure. \n* Determining whether further actions are required as a result of the security failure. \n* Implementing controls to prevent the cause of failure from reoccurring. \n* Resuming monitoring of security controls."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-11",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "11"
          }
        ],
        "groups": [
          {
            "id": "PCI-11.1",
            "title": "Processes and mechanisms for regularly testing security of systems and networks are defined and understood.",
            "props": [
              {
                "name": "label",
                "value": "11.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-11.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.1.1_smt",
                    "name": "statement",
                    "prose": "All security policies and operational procedures that are identified in Requirement 11 are: \n* Documented. \n* Kept up to date. \n* In use. \n* Known to all affected parties."
                  }
                ]
              },
              {
                "id": "PCI-11.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.1.2_smt",
                    "name": "statement",
                    "prose": "Roles and responsibilities for performing activities in Requirement 11 are documented, assigned, and understood."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-11.2",
            "title": "Wireless access points are identified and monitored, and unauthorized wireless access points are addressed.",
            "props": [
              {
                "name": "label",
                "value": "11.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-11.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.2.1_smt",
                    "name": "statement",
                    "prose": "Authorized and unauthorized wireless access points are managed as follows: \n* The presence of wireless (Wi-Fi) access points is tested for, \n* All authorized and unauthorized wireless access points are detected and identified, \n* Testing, detection, and identification occurs at least once every three months. \n* If automated monitoring is used, personnel are notified via generated alerts."
                  }
                ]
              },
              {
                "id": "PCI-11.2.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.2.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.2.2_smt",
                    "name": "statement",
                    "prose": "An inventory of authorized wireless access points is maintained, including a documented business justification."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-11.3",
            "title": "External and internal vulnerabilities are regularly identified, prioritized, and addressed.",
            "props": [
              {
                "name": "label",
                "value": "11.3"
              }
            ],
            "controls": [
              {
                "id": "PCI-11.3.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.3.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.3.1_smt",
                    "name": "statement",
                    "prose": "Internal vulnerability scans are performed as follows: \n* At least once every three months. \n* High-risk and critical vulnerabilities (per the entity’s vulnerability risk rankings defined at Requirement 6.3.1) are resolved. \n* Rescans are performed that confirm all highrisk and critical vulnerabilities (as noted above) have been resolved. \n* Scan tool is kept up to date with latest vulnerability information. \n* Scans are performed by qualified personnel and organizational independence of the tester exists."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-11.3.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "11.3.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-11.3.1.1_smt",
                        "name": "statement",
                        "prose": "All other applicable vulnerabilities (those not ranked as high-risk or critical per the entity’s vulnerability risk rankings defined at Requirement 6.3.1) are managed as follows: \n* Addressed based on the risk defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1. \n* Rescans are conducted as needed."
                      }
                    ]
                  },
                  {
                    "id": "PCI-11.3.1.2",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "11.3.1.2"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-11.3.1.2_smt",
                        "name": "statement",
                        "prose": "Internal vulnerability scans are performed via authenticated scanning as follows: \n* Systems that are unable to accept credentials for authenticated scanning are documented. \n* Sufficient privileges are used for those systems that accept credentials for scanning. \n* If accounts used for authenticated scanning can be used for interactive login, they are managed in accordance with Requirement 8.2.2."
                      }
                    ]
                  },
                  {
                    "id": "PCI-11.3.1.3",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "11.3.1.3"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-11.3.1.3_smt",
                        "name": "statement",
                        "prose": "Internal vulnerability scans are performed after any significant change as follows: \n* High-risk and critical vulnerabilities (per the entity’s vulnerability risk rankings defined at Requirement 6.3.1) are resolved. \n* Rescans are conducted as needed. \n* Scans are performed by qualified personnel and organizational independence of the tester exists (not required to be a QSA or ASV)."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-11.3.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.3.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.3.2_smt",
                    "name": "statement",
                    "prose": "External vulnerability scans are performed as follows: \n* At least once every three months. \n* By a PCI SSC Approved Scanning Vendor (ASV). \n* Vulnerabilities are resolved and ASV Program Guide requirements for a passing scan are met. \n* Rescans are performed as needed to confirm that vulnerabilities are resolved per the ASV Program Guide requirements for a passing scan."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-11.3.2.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "11.3.2.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-11.3.2.1_smt",
                        "name": "statement",
                        "prose": "External vulnerability scans are performed after any significant change as follows: \n* Vulnerabilities that are scored 4.0 or higher by the CVSS are resolved. \n* Rescans are conducted as needed. \n* Scans are performed by qualified personnel and organizational independence of the tester exists (not required to be a QSA or ASV)."
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-11.4",
            "title": "External and internal penetration testing is regularly performed, and exploitable vulnerabilities and security weaknesses are corrected.",
            "props": [
              {
                "name": "label",
                "value": "11.4"
              }
            ],
            "controls": [
              {
                "id": "PCI-11.4.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.4.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.4.1_smt",
                    "name": "statement",
                    "prose": "A penetration testing methodology is defined, documented, and implemented by the entity, and includes: \n* Industry-accepted penetration testing approaches. \n* Coverage for the entire CDE perimeter and critical systems. \n* Testing from both inside and outside the network. \n* Testing to validate any segmentation and scopereduction controls. \n* Application-layer penetration testing to identify, at a minimum, the vulnerabilities listed in Requirement 6.2.4. \n* Network-layer penetration tests that encompass all components that support network functions as well as operating systems. \n* Review and consideration of threats and vulnerabilities experienced in the last 12 months. \n* Documented approach to assessing and addressing the risk posed by exploitable vulnerabilities and security weaknesses found during penetration testing. \n* Retention of penetration testing results and remediation activities results for at least 12 months."
                  }
                ]
              },
              {
                "id": "PCI-11.4.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.4.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.4.2_smt",
                    "name": "statement",
                    "prose": "Internal penetration testing is performed: \n* Per the entity’s defined methodology, \n* At least once every 12 months \n* After any significant infrastructure or application upgrade or change \n* By a qualified internal resource or qualified external third-party \n* Organizational independence of the tester exists (not required to be a QSA or ASV)."
                  }
                ]
              },
              {
                "id": "PCI-11.4.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.4.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.4.3_smt",
                    "name": "statement",
                    "prose": "External penetration testing is performed: \n* Per the entity’s defined methodology \n* At least once every 12 months \n* After any significant infrastructure or application upgrade or change \n* By a qualified internal resource or qualified external third party \n* Organizational independence of the tester exists (not required to be a QSA or ASV)."
                  }
                ]
              },
              {
                "id": "PCI-11.4.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.4.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.4.4_smt",
                    "name": "statement",
                    "prose": "Exploitable vulnerabilities and security weaknesses found during penetration testing are corrected as follows: \n* In accordance with the entity’s assessment of the risk posed by the security issue as defined in Requirement 6.3.1. \n* Penetration testing is repeated to verify the corrections."
                  }
                ]
              },
              {
                "id": "PCI-11.4.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.4.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.4.5_smt",
                    "name": "statement",
                    "prose": "If segmentation is used to isolate the CDE from other networks, penetration tests are performed on segmentation controls as follows: \n* At least once every 12 months and after any changes to segmentation controls/methods \n* Covering all segmentation controls/methods in use. \n* According to the entity’s defined penetration testing methodology. \n* Confirming that the segmentation controls/methods are operational and effective, and isolate the CDE from all out-of-scope systems. \n* Confirming effectiveness of any use of isolation to separate systems with differing security levels (see Requirement 2.2.3). \n* Performed by a qualified internal resource or qualified external third party. \n* Organizational independence of the tester exists (not required to be a QSA or ASV)."
                  }
                ]
              },
              {
                "id": "PCI-11.4.6",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.4.6"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.4.6_smt",
                    "name": "statement",
                    "prose": "Additional requirement for service providers only: If segmentation is used to isolate the CDE from other networks, penetration tests are performed on segmentation controls as follows: \n* At least once every six months and after any changes to segmentation controls/methods. \n* Covering all segmentation controls/methods in use. \n* According to the entity’s defined penetration testing methodology. \n* Confirming that the segmentation controls/methods are operational and effective, and isolate the CDE from all out-of-scope systems. \n* Confirming effectiveness of any use of isolation to separate systems with differing security levels (see Requirement 2.2.3). \n* Performed by a qualified internal resource or qualified external third party. \n* Organizational independence of the tester exists (not required to be a QSA or ASV)."
                  }
                ]
              },
              {
                "id": "PCI-11.4.7",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.4.7"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.4.7_smt",
                    "name": "statement",
                    "prose": "Additional requirement for multi-tenant service providers only: Multi-tenant service providers support their customers for external penetration testing per Requirement 11.4.3 and 11.4.4."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-11.5",
            "title": "Network intrusions and unexpected file changes are detected and responded to.",
            "props": [
              {
                "name": "label",
                "value": "11.5"
              }
            ],
            "controls": [
              {
                "id": "PCI-11.5.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.5.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.5.1_smt",
                    "name": "statement",
                    "prose": "Intrusion-detection and/or intrusionprevention techniques are used to detect and/or prevent intrusions into the network as follows: \n* All traffic is monitored at the perimeter of the CDE. \n* All traffic is monitored at critical points in the CDE. \n* Personnel are alerted to suspected compromises. \n* All intrusion-detection and prevention engines, baselines, and signatures are kept up to date."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-11.5.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "11.5.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-11.5.1.1_smt",
                        "name": "statement",
                        "prose": "Additional requirement for service providers only: Intrusion-detection and/or intrusion-prevention techniques detect, alert on/prevent, and address covert malware communication channels."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-11.5.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.5.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.5.2_smt",
                    "name": "statement",
                    "prose": "A change-detection mechanism (for example, file integrity monitoring tools) is deployed as follows: \n* To alert personnel to unauthorized modification (including changes, additions, and deletions) of critical files. \n* To perform critical file comparisons at least once weekly."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-11.6",
            "title": "Unauthorized changes on payment pages are detected and responded to.",
            "props": [
              {
                "name": "label",
                "value": "11.6"
              }
            ],
            "controls": [
              {
                "id": "PCI-11.6.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "11.6.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-11.6.1_smt",
                    "name": "statement",
                    "prose": "A change\n    * and tamper-detection mechanism is deployed as follows: \n* To alert personnel to unauthorized modification (including indicators of compromise, changes, additions, and deletions) to the HTTP headers and the contents of payment pages as received by the consumer browser. \n* The mechanism is configured to evaluate the received HTTP header and payment page. \n* The mechanism functions are performed as follows: \n    * At least once every seven days\nOR\n\n    * Periodically (at the frequency defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1)."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-12",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "12"
          }
        ],
        "groups": [
          {
            "id": "PCI-12.1",
            "title": "A comprehensive information security policy that governs and provides direction for protection of the entity’s information assets is known and current.",
            "props": [
              {
                "name": "label",
                "value": "12.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-12.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.1.1_smt",
                    "name": "statement",
                    "prose": "An overall information security policy is: \n* Established. \n* Published. \n* Maintained. \n* Disseminated to all relevant personnel, as well as to relevant vendors and business partners."
                  }
                ]
              },
              {
                "id": "PCI-12.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.1.2_smt",
                    "name": "statement",
                    "prose": "The information security policy is: \n* Reviewed at least once every 12 months. \n* Updated as needed to reflect changes to business objectives or risks to the environment."
                  }
                ]
              },
              {
                "id": "PCI-12.1.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.1.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.1.3_smt",
                    "name": "statement",
                    "prose": "The security policy clearly defines information security roles and responsibilities for all personnel, and all personnel are aware of and acknowledge their information security responsibilities."
                  }
                ]
              },
              {
                "id": "PCI-12.1.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.1.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.1.4_smt",
                    "name": "statement",
                    "prose": "Responsibility for information security is formally assigned to a Chief Information Security Officer or other information security knowledgeable member of executive management."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-12.2",
            "title": "Acceptable use policies for end-user technologies are defined and implemented.",
            "props": [
              {
                "name": "label",
                "value": "12.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-12.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.2.1_smt",
                    "name": "statement",
                    "prose": "Acceptable use policies for end-user technologies are documented and implemented, including: \n* Explicit approval by authorized parties. \n* Acceptable uses of the technology. \n* List of products approved by the company for employee use, including hardware and software."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-12.3",
            "title": "Risks to the cardholder data environment are formally identified, evaluated, and managed.",
            "props": [
              {
                "name": "label",
                "value": "12.3"
              }
            ],
            "controls": [
              {
                "id": "PCI-12.3.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.3.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.3.1_smt",
                    "name": "statement",
                    "prose": "Each PCI DSS requirement that provides flexibility for how frequently it is performed (for example, requirements to be performed periodically) is supported by a targeted risk analysis that is documented and includes: \n* Identification of the assets being protected. \n* Identification of the threat(s) that the requirement is protecting against. \n* Identification of factors that contribute to the likelihood and/or impact of a threat being realized. \n* Resulting analysis that determines, and includes justification for, how frequently the requirement must be performed to minimize the likelihood of the threat being realized. \n* Review of each targeted risk analysis at least once every 12 months to determine whether the results are still valid or if an updated risk analysis is needed. \n* Performance of updated risk analyses when needed, as determined by the annual review."
                  }
                ]
              },
              {
                "id": "PCI-12.3.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.3.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.3.2_smt",
                    "name": "statement",
                    "prose": "A targeted risk analysis is performed for each PCI DSS requirement that the entity meets with the customized approach, to include: \n* Documented evidence detailing each element specified in Appendix D: Customized Approach (including, at a minimum, a controls matrix and risk analysis). \n* Approval of documented evidence by senior management. \n* Performance of the targeted analysis of risk at least once every 12 months."
                  }
                ]
              },
              {
                "id": "PCI-12.3.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.3.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.3.3_smt",
                    "name": "statement",
                    "prose": "Cryptographic cipher suites and protocols in use are documented and reviewed at least once every 12 months, including at least the following: \n* An up-to-date inventory of all cryptographic cipher suites and protocols in use, including purpose and where used. \n* Active monitoring of industry trends regarding continued viability of all cryptographic cipher suites and protocols in use. \n* A documented strategy to respond to anticipated changes in cryptographic vulnerabilities."
                  }
                ]
              },
              {
                "id": "PCI-12.3.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.3.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.3.4_smt",
                    "name": "statement",
                    "prose": "Hardware and software technologies in use are reviewed at least once every 12 months, including at least the following: \n* Analysis that the technologies continue to receive security fixes from vendors promptly. \n* Analysis that the technologies continue to support (and do not preclude) the entity’s PCI DSS compliance. \n* Documentation of any industry announcements or trends related to a technology, such as when a vendor has announced “end of life” plans for a technology. \n* Documentation of a plan, approved by senior management, to remediate outdated technologies, including those for which vendors have announced “end of life” plans."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-12.4",
            "title": "PCI DSS compliance is managed.",
            "props": [
              {
                "name": "label",
                "value": "12.4"
              }
            ],
            "controls": [
              {
                "id": "PCI-12.4.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.4.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.4.1_smt",
                    "name": "statement",
                    "prose": "Additional requirement for service providers only: Responsibility is established by executive management for the protection of cardholder data and a PCI DSS compliance program to include: \n* Overall accountability for maintaining PCI DSS compliance. \n* Defining a charter for a PCI DSS compliance program and communication to executive management."
                  }
                ]
              },
              {
                "id": "PCI-12.4.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.4.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.4.2_smt",
                    "name": "statement",
                    "prose": "Additional requirement for service providers only: Reviews are performed at least once every three months to confirm that personnel are performing their tasks in accordance with all security policies and operational procedures. Reviews are performed by personnel other than those responsible for performing the given task and include, but are not limited to, the following tasks: \n* Daily log reviews. \n* Configuration reviews for network security controls. \n* Applying configuration standards to new systems. \n* Responding to security alerts. \n* Change-management processes."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-12.4.2.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "12.4.2.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-12.4.2.1_smt",
                        "name": "statement",
                        "prose": "Additional requirement for service providers only: Reviews conducted in accordance with Requirement 12.4.2 are documented to include: \n* Results of the reviews. \n* Documented remediation actions taken for any tasks that were found to not be performed at Requirement 12.4.2. \n* Review and sign-off of results by personnel assigned responsibility for the PCI DSS compliance program."
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-12.5",
            "title": "PCI DSS scope is documented and validated.",
            "props": [
              {
                "name": "label",
                "value": "12.5"
              }
            ],
            "controls": [
              {
                "id": "PCI-12.5.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.5.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.5.1_smt",
                    "name": "statement",
                    "prose": "An inventory of system components that are in scope for PCI DSS, including a description of function/use, is maintained and kept current."
                  }
                ]
              },
              {
                "id": "PCI-12.5.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.5.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.5.2_smt",
                    "name": "statement",
                    "prose": "PCI DSS scope is documented and confirmed by the entity at least once every 12 months and upon significant change to the in-scope environment. At a minimum, the scoping validation includes: \n* Identifying all data flows for the various payment stages (for example, authorization, capture settlement, chargebacks, and refunds) and acceptance channels (for example, card-present, card-not-present, and e-commerce). \n* Updating all data-flow diagrams per Requirement 1.2.4. \n* Identifying all locations where account data is stored, processed, and transmitted, including but not limited to: 1) any locations outside of the currently defined CDE, 2) applications that process CHD, 3) transmissions between systems and networks, and 4) file backups. \n* Identifying all system components in the CDE, connected to the CDE, or that could impact security of the CDE. \n* Identifying all segmentation controls in use and the environment(s) from which the CDE is segmented, including justification for environments being out of scope. \n* Identifying all connections from third-party entities with access to the CDE. \n* Confirming that all identified data flows, account data, system components, segmentation controls, and connections from third parties with access to the CDE are included in scope."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-12.5.2.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "12.5.2.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-12.5.2.1_smt",
                        "name": "statement",
                        "prose": "Additional requirement for service providers only: PCI DSS scope is documented and confirmed by the entity at least once every six months and upon significant change to the in-scope environment. At a minimum, the scoping validation includes all the elements specified in Requirement 12.5.2."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-12.5.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.5.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.5.3_smt",
                    "name": "statement",
                    "prose": "Additional requirement for service providers only: Significant changes to organizational structure result in a documented (internal) review of the impact to PCI DSS scope and applicability of controls, with results communicated to executive management."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-12.6",
            "title": "Security awareness education is an ongoing activity.",
            "props": [
              {
                "name": "label",
                "value": "12.6"
              }
            ],
            "controls": [
              {
                "id": "PCI-12.6.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.6.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.6.1_smt",
                    "name": "statement",
                    "prose": "A formal security awareness program is implemented to make all personnel aware of the entity’s information security policy and procedures, and their role in protecting the cardholder data."
                  }
                ]
              },
              {
                "id": "PCI-12.6.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.6.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.6.2_smt",
                    "name": "statement",
                    "prose": "The security awareness program is: \n* Reviewed at least once every 12 months, and \n* Updated as needed to address any new threats and vulnerabilities that may impact the security of the entity’s CDE, or the information provided to personnel about their role in protecting cardholder data."
                  }
                ]
              },
              {
                "id": "PCI-12.6.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.6.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.6.3_smt",
                    "name": "statement",
                    "prose": "Personnel receive security awareness training as follows: \n* Upon hire and at least once every 12 months. \n* Multiple methods of communication are used. \n* Personnel acknowledge at least once every 12 months that they have read and understood the information security policy and procedures."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-12.6.3.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "12.6.3.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-12.6.3.1_smt",
                        "name": "statement",
                        "prose": "Security awareness training includes awareness of threats and vulnerabilities that could impact the security of the CDE, including but not limited to: \n* Phishing and related attacks. \n* Social engineering."
                      }
                    ]
                  },
                  {
                    "id": "PCI-12.6.3.2",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "12.6.3.2"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-12.6.3.2_smt",
                        "name": "statement",
                        "prose": "Security awareness training includes awareness about the acceptable use of end-user technologies in accordance with Requirement 12.2.1."
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-12.7",
            "title": "Personnel are screened to reduce risks from insider threats.",
            "props": [
              {
                "name": "label",
                "value": "12.7"
              }
            ],
            "controls": [
              {
                "id": "PCI-12.7.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.7.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.7.1_smt",
                    "name": "statement",
                    "prose": "Potential personnel who will have access to the CDE are screened, within the constraints of local laws, prior to hire to minimize the risk of attacks from internal sources."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-12.8",
            "title": "Risk to information assets associated with third-party service provider (TPSP) relationships is managed.",
            "props": [
              {
                "name": "label",
                "value": "12.8"
              }
            ],
            "controls": [
              {
                "id": "PCI-12.8.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.8.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.8.1_smt",
                    "name": "statement",
                    "prose": "A list of all third-party service providers (TPSPs) with which account data is shared or that could affect the security of account data is maintained, including a description for each of the services provided."
                  }
                ]
              },
              {
                "id": "PCI-12.8.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.8.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.8.2_smt",
                    "name": "statement",
                    "prose": "Written agreements with TPSPs are maintained as follows: \n* Written agreements are maintained with all TPSPs with which account data is shared or that could affect the security of the CDE. \n* Written agreements include acknowledgments from TPSPs that they are responsible for the security of account data the TPSPs possess or otherwise store, process, or transmit on behalf of the entity, or to the extent that they could impact the security of the entity’s CDE."
                  }
                ]
              },
              {
                "id": "PCI-12.8.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.8.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.8.3_smt",
                    "name": "statement",
                    "prose": "An established process is implemented for engaging TPSPs, including proper due diligence prior to engagement."
                  }
                ]
              },
              {
                "id": "PCI-12.8.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.8.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.8.4_smt",
                    "name": "statement",
                    "prose": "A program is implemented to monitor TPSPs’ PCI DSS compliance status at least once every 12 months."
                  }
                ]
              },
              {
                "id": "PCI-12.8.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.8.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.8.5_smt",
                    "name": "statement",
                    "prose": "Information is maintained about which PCI DSS requirements are managed by each TPSP, which are managed by the entity, and any that are shared between the TPSP and the entity."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-12.9",
            "title": "Third-party service providers (TPSPs) support their customers’ PCI DSS compliance.",
            "props": [
              {
                "name": "label",
                "value": "12.9"
              }
            ],
            "controls": [
              {
                "id": "PCI-12.9.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.9.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.9.1_smt",
                    "name": "statement",
                    "prose": "Additional requirement for service providers only: TPSPs acknowledge in writing to customers that they are responsible for the security of account data the TPSP possesses or otherwise stores, processes, or transmits on behalf of the customer, or to the extent that they could impact the security of the customer’s CDE."
                  }
                ]
              },
              {
                "id": "PCI-12.9.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.9.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.9.2_smt",
                    "name": "statement",
                    "prose": "Additional requirement for service providers only: TPSPs support their customers’ requests for information to meet Requirements 12.8.4 and 12.8.5 by providing the following upon customer request: \n* PCI DSS compliance status information for any service the TPSP performs on behalf of customers (Requirement 12.8.4). \n* Information about which PCI DSS requirements are the responsibility of the TPSP and which are the responsibility of the customer, including any shared responsibilities (Requirement 12.8.5)."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-12.10",
            "title": "Suspected and confirmed security incidents that could impact the CDE are responded to immediately.",
            "props": [
              {
                "name": "label",
                "value": "12.10"
              }
            ],
            "controls": [
              {
                "id": "PCI-12.10.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.10.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.10.1_smt",
                    "name": "statement",
                    "prose": "An incident response plan exists and is ready to be activated in the event of a suspected or confirmed security incident. The plan includes, but is not limited to: \n* Roles, responsibilities, and communication and contact strategies in the event of a suspected or confirmed security incident, including notification of payment brands and acquirers, at a minimum. \n* Incident response procedures with specific containment and mitigation activities for different types of incidents. \n* Business recovery and continuity procedures. \n* Data backup processes. \n* Analysis of legal requirements for reporting compromises. \n* Coverage and responses of all critical system components. \n* Reference or inclusion of incident response procedures from the payment brands."
                  }
                ]
              },
              {
                "id": "PCI-12.10.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.10.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.10.2_smt",
                    "name": "statement",
                    "prose": "At least once every 12 months, the security incident response plan is: \n* Reviewed and the content is updated as needed. \n* Tested, including all elements listed in Requirement 12.10.1."
                  }
                ]
              },
              {
                "id": "PCI-12.10.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.10.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.10.3_smt",
                    "name": "statement",
                    "prose": "Specific personnel are designated to be available on a 24/7 basis to respond to suspected or confirmed security incidents."
                  }
                ]
              },
              {
                "id": "PCI-12.10.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.10.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.10.4_smt",
                    "name": "statement",
                    "prose": "Personnel responsible for responding to suspected and confirmed security incidents are appropriately and periodically trained on their incident response responsibilities."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-12.10.4.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "12.10.4.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-12.10.4.1_smt",
                        "name": "statement",
                        "prose": "The frequency of periodic training for incident response personnel is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-12.10.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.10.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.10.5_smt",
                    "name": "statement",
                    "prose": "The security incident response plan includes monitoring and responding to alerts from security monitoring systems, including but not limited to: \n* Intrusion-detection and intrusion-prevention systems. \n* Network security controls. \n* Change-detection mechanisms for critical files. \n* The change-and tamper-detection mechanism for payment pages. This bullet is a best practice until its effective date; refer to Applicability Notes below for details. \n* Detection of unauthorized wireless access points."
                  }
                ]
              },
              {
                "id": "PCI-12.10.6",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.10.6"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.10.6_smt",
                    "name": "statement",
                    "prose": "The security incident response plan is modified and evolved according to lessons learned and to incorporate industry developments."
                  }
                ]
              },
              {
                "id": "PCI-12.10.7",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "12.10.7"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-12.10.7_smt",
                    "name": "statement",
                    "prose": "Incident response procedures are in place, to be initiated upon the detection of stored PAN anywhere it is not expected, and include: \n* Determining what to do if PAN is discovered outside the CDE, including its retrieval, secure deletion, and/or migration into the currently defined CDE, as applicable. \n* Identifying whether sensitive authentication data is stored with PAN. \n* Determining where the account data came from and how it ended up where it was not expected. \n* Remediating data leaks or process gaps that resulted in the account data being where it was not expected."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-2",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "2"
          }
        ],
        "groups": [
          {
            "id": "PCI-2.1",
            "title": "Processes and mechanisms for applying secure configurations to all system components are defined and understood.",
            "props": [
              {
                "name": "label",
                "value": "2.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-2.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "2.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-2.1.1_smt",
                    "name": "statement",
                    "prose": "All security policies and operational procedures that are identified in Requirement 2 are: \n* Documented. \n* Kept up to date. \n* In use. \n* Known to all affected parties."
                  },
                  {
                    "id": "PCI-2.1.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "2.1.1 Examine documentation and interview personnel to verify that security policies and operational procedures identified in Requirement 2 are managed in accordance with all elements specified in this requirement."
                  },
                  {
                    "id": "PCI-2.1.1_gdn",
                    "name": "guidance",
                    "prose": "It is important to update policies and procedures as needed to address changes in processes, technologies, and business objectives. For this reason, consider updating these documents as soon as possible after a change occurs and not only on a periodic cycle"
                  }
                ]
              },
              {
                "id": "PCI-2.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "2.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-2.1.2_smt",
                    "name": "statement",
                    "prose": "Roles and responsibilities for performing activities in Requirement 2 are documented, assigned, and understood."
                  },
                  {
                    "id": "PCI-2.1.2_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine documentation to verify that descriptions of roles and responsibilities for performing activities in Requirement 2 are documented and assigned.\nInterview personnel with responsibility for performing activities in Requirement 2 to verify that roles and responsibilities are assigned as documented and are understood."
                  },
                  {
                    "id": "PCI-2.1.2_gdn",
                    "name": "guidance",
                    "prose": "Roles and responsibilities may be documented within policies and procedures or maintained within separate documents. As part of communicating roles and responsibilities, entities can consider having personnel acknowledge their acceptance and understanding of their assigned roles and responsibilities."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-2.2",
            "title": "System components are configured and managed securely.",
            "props": [
              {
                "name": "label",
                "value": "2.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-2.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "2.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-2.2.1_smt",
                    "name": "statement",
                    "prose": "Configuration standards are developed, implemented, and maintained to: \n* Cover all system components. \n* Address all known security vulnerabilities. \n* Be consistent with industry-accepted system hardening standards or vendor hardening recommendations. \n* Be updated as new vulnerability issues are identified, as defined in Requirement 6.3.1. \n* Be applied when new systems are configured and verified as in place before or immediately after a system component is connected to a production environment."
                  },
                  {
                    "id": "PCI-2.2.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine system configuration standards to verify they define processes that include all elements specified in this requirement.\nExamine policies and procedures and interview personnel to verify that system configuration standards are updated as new vulnerability issues are identified, as defined in Requirement 6.3.1.\nExamine configuration settings and interview personnel to verify that system configuration standards are applied when new systems are configured and verified as being in place before or immediately after a system component is connected to a production environment."
                  },
                  {
                    "id": "PCI-2.2.1_gdn",
                    "name": "guidance",
                    "prose": "Keeping up to date with current industry guidance will help the entity maintain secure configurations. The specific controls to be applied to a system will vary and should be appropriate for the type and function of the system. Numerous security organizations have established system-hardening guidelines and recommendations, which advise how to correct common, known weaknesses."
                  }
                ]
              },
              {
                "id": "PCI-2.2.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "2.2.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-2.2.2_smt",
                    "name": "statement",
                    "prose": "Vendor default accounts are managed as follows: \n* If the vendor default account(s) will be used, the default password is changed per Requirement 8.3.6. \n* If the vendor default account(s) will not be used, the account is removed or disabled."
                  },
                  {
                    "id": "PCI-2.2.2_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine system configuration standards to verify they include managing vendor default accounts in accordance with all elements specified in this requirement.\nExamine vendor documentation and observe a system administrator logging on using vendor default accounts to verify accounts are implemented in accordance with all elements specified in this requirement.\nExamine configuration files and interview personnel to verify that all vendor default accounts that will not be used are removed or disabled."
                  },
                  {
                    "id": "PCI-2.2.2_gdn",
                    "name": "guidance",
                    "prose": "All vendor default accounts should be identified, and their purpose and use understood. It is important to establish controls for application and system accounts, including those used to deploy and maintain cloud services so that they do not use default passwords and are not usable by unauthorized individuals. Where a default account is not intended to be used, changing the default password to a unique password that meets PCI DSS Requirement 8.3.6, removing any access to the default account, and then disabling the account, will prevent a malicious individual from re-enabling the account and gaining access with the default password. Using an isolated staging network to install and configure new systems is recommended and can also be used to confirm that default credentials have not been introduced into production environments."
                  }
                ]
              },
              {
                "id": "PCI-2.2.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "2.2.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-2.2.3_smt",
                    "name": "statement",
                    "prose": "Primary functions requiring different security levels are managed as follows: \n* Only one primary function exists on a system component,\nOR\n\n* Primary functions with differing security levels that exist on the same system component are isolated from each other,\nOR\n\n* Primary functions with differing security levels on the same system component are all secured to the level required by the function with the highest security need."
                  },
                  {
                    "id": "PCI-2.2.3_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine system configuration standards to verify they include managing primary functions requiring different security levels as specified in this requirement.\nExamine system configurations to verify that primary functions requiring different security levels are managed per one of the ways specified in this requirement.\nWhere virtualization technologies are used, examine the system configurations to verify that system functions requiring different security levels are managed in one of the following ways: \n* Functions with differing security needs do not co-exist on the same system component. \n* Functions with differing security needs that exist on the same system component are isolated from each other. \n* Functions with differing security needs on the same system component are all secured to the level required by the function with the highest security need."
                  },
                  {
                    "id": "PCI-2.2.3_gdn",
                    "name": "guidance",
                    "prose": "Ideally, each function should be placed on different system components. This can be achieved by implementing only one primary function on each system component. Another option is to isolate primary functions on the same system component that have different security levels, for example, isolating web servers (which need to be directly connected to the Internet) from application and database servers. If a system component contains primary functions that need different security levels, a third option is to implement additional controls to ensure that the resultant security level of the primary function(s) with higher security needs is not reduced by the presence of the lower security primary functions. Additionally, the functions with a lower security level should be isolated and/or secured to ensure they cannot access or affect the resources of another system function, and do not introduce security weaknesses to other functions on the same server. Functions of differing security levels may be isolated by either physical or logical controls. For example, a database system should not also be hosting web services unless using controls like virtualization technologies to isolate and contain the functions into separate sub-systems. Another example is using virtual instances or providing dedicated memory access by system function. Where virtualization technologies are used, the security levels should be identified and managed for each virtual component. Examples of considerations for virtualized environments include: \n* The function of each application, container, or virtual server instance. \n* How virtual machines (VMs) or containers are stored and secured."
                  }
                ]
              },
              {
                "id": "PCI-2.2.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "2.2.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-2.2.4_smt",
                    "name": "statement",
                    "prose": "Only necessary services, protocols, daemons, and functions are enabled, and all unnecessary functionality is removed or disabled."
                  },
                  {
                    "id": "PCI-2.2.4_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine system configuration standards to verify necessary system services, protocols, and daemons are identified and documented.\nExamine system configurations to verify the following: \n* All unnecessary functionality is removed or disabled. \n* Only required functionality, as documented in the configuration standards, is enabled."
                  },
                  {
                    "id": "PCI-2.2.4_gdn",
                    "name": "guidance",
                    "prose": "There are many protocols that could be enabled by default that are commonly used by malicious individuals to compromise a network. Disabling or removing all services, functions, and protocols that are not used minimizes the potential attack surface—for example, by removing or disabling an unused FTP or web server."
                  }
                ]
              },
              {
                "id": "PCI-2.2.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "2.2.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-2.2.5_smt",
                    "name": "statement",
                    "prose": "If any insecure services, protocols, or daemons are present: \n* Business justification is documented. \n* Additional security features are documented and implemented that reduce the risk of using insecure services, protocols, or daemons."
                  },
                  {
                    "id": "PCI-2.2.5_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "If any insecure services, protocols, or daemons are present, examine system configuration standards and interview personnel to verify they are managed and implemented in accordance with all elements specified in this requirement.\nIf any insecure services, protocols, or daemons, are present, examine configuration settings to verify that additional security features are implemented to reduce the risk of using insecure services, daemons, and protocols."
                  },
                  {
                    "id": "PCI-2.2.5_gdn",
                    "name": "guidance",
                    "prose": "Enabling security features before new system components are deployed will prevent insecure configurations from being introduced into the environment. Some vendor solutions may provide additional security functions to assist with securing an insecure process."
                  }
                ]
              },
              {
                "id": "PCI-2.2.6",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "2.2.6"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-2.2.6_smt",
                    "name": "statement",
                    "prose": "System security parameters are configured to prevent misuse."
                  },
                  {
                    "id": "PCI-2.2.6_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine system configuration standards to verify they include configuring system security parameters to prevent misuse.\nInterview system administrators and/or security managers to verify they have knowledge of common security parameter settings for system components.\nExamine system configurations to verify that common security parameters are set appropriately and in accordance with the system configuration standards."
                  },
                  {
                    "id": "PCI-2.2.6_gdn",
                    "name": "guidance",
                    "prose": "System configuration standards and related processes should specifically address security settings and parameters that have known security implications for each type of system in use. For systems to be configured securely, personnel responsible for configuration and/or administering systems should be knowledgeable in the specific security parameters and settings that apply to the system. Considerations should also include secure settings for parameters used to access cloud portals."
                  }
                ]
              },
              {
                "id": "PCI-2.2.7",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "2.2.7"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-2.2.7_smt",
                    "name": "statement",
                    "prose": "All non-console administrative access is encrypted using strong cryptography."
                  },
                  {
                    "id": "PCI-2.2.7_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine system configuration standards to verify they include encrypting all non-console administrative access using strong cryptography.\nObserve an administrator log on to system components and examine system configurations to verify that non-console administrative access is managed in accordance with this requirement.\nExamine settings for system components and authentication services to verify that insecure remote login services are not available for non- console administrative access.\nExamine vendor documentation and interview personnel to verify that strong cryptography for the technology in use is implemented according to industry best practices and/or vendor recommendations."
                  },
                  {
                    "id": "PCI-2.2.7_gdn",
                    "name": "guidance",
                    "prose": "Whichever security protocol is used, it should be configured to use only secure versions and configurations to prevent use of an insecure connection—for example, by using only trusted certificates, supporting only strong encryption, and not supporting fallback to weaker, insecure protocols or methods."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-2.3",
            "title": "Wireless environments are configured and managed securely.",
            "props": [
              {
                "name": "label",
                "value": "2.3"
              }
            ],
            "controls": [
              {
                "id": "PCI-2.3.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "2.3.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-2.3.1_smt",
                    "name": "statement",
                    "prose": "For wireless environments connected to the CDE or transmitting account data, all wireless vendor defaults are changed at installation or are confirmed to be secure, including but not limited to: \n* Default wireless encryption keys. \n* Passwords on wireless access points. \n* SNMP defaults. \n* Any other security-related wireless vendor defaults."
                  },
                  {
                    "id": "PCI-2.3.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine policies and procedures and interview responsible personnel to verify that processes are defined for wireless vendor defaults to either change them upon installation or to confirm them to be secure in accordance with all elements of this requirement.\nExamine vendor documentation and observe a system administrator logging into wireless devices to verify: \n* SNMP defaults are not used. \n* Default passwords/passphrases on wireless access points are not used.\nExamine vendor documentation and wireless configuration settings to verify other security-related wireless vendor defaults were changed, if applicable."
                  },
                  {
                    "id": "PCI-2.3.1_gdn",
                    "name": "guidance",
                    "prose": "Wireless passwords should be constructed so that they are resistant to offline brute force attacks."
                  }
                ]
              },
              {
                "id": "PCI-2.3.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "2.3.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-2.3.2_smt",
                    "name": "statement",
                    "prose": "For wireless environments connected to the CDE or transmitting account data, wireless encryption keys are changed as follows: \n* Whenever personnel with knowledge of the key leave the company or the role for which the knowledge was necessary. \n* Whenever a key is suspected of or known to be compromised."
                  },
                  {
                    "id": "PCI-2.3.2_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "2.3.2 Interview responsible personnel and examine key-management documentation to verify that wireless encryption keys are changed in accordance with all elements specified in this requirement."
                  },
                  {
                    "id": "PCI-2.3.2_gdn",
                    "name": "guidance",
                    "prose": "This goal can be accomplished in multiple ways, including periodic changes of keys, changing keys via a defined “joiners-movers-leavers” (JML) process, implementing additional technical controls, and not using fixed pre-shared keys. In addition, any keys that are known to be, or suspected of being, compromised should be managed in accordance with the entity’s incident response plan at Requirement 12.10.1."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-3",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "3"
          }
        ],
        "groups": [
          {
            "id": "PCI-3.1",
            "title": "Processes and mechanisms for protecting stored account data are defined and understood.",
            "props": [
              {
                "name": "label",
                "value": "3.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-3.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.1.1_smt",
                    "name": "statement",
                    "prose": "All security policies and operational procedures that are identified in Requirement 3 are: \n* Documented. \n* Kept up to date. \n* In use. \n* Known to all affected parties"
                  },
                  {
                    "id": "PCI-3.1.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "3.1.1 Examine documentation and interview personnel to verify that security policies and operational procedures identified in Requirement 3 are managed in accordance with all elements specified in this requirement."
                  },
                  {
                    "id": "PCI-3.1.1_gdn",
                    "name": "guidance",
                    "prose": "It is important to update policies and procedures as needed to address changes in processes, technologies, and business objectives. For this reason, consider updating these documents as soon as possible after a change occurs and not only on a periodic cycle."
                  }
                ]
              },
              {
                "id": "PCI-3.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.1.2_smt",
                    "name": "statement",
                    "prose": "Roles and responsibilities for performing activities in Requirement 3 are documented, assigned, and understood."
                  },
                  {
                    "id": "PCI-3.1.2_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine documentation to verify that descriptions of roles and responsibilities performing activities in Requirement 3 are documented and assigned.\nInterview personnel with responsibility for performing activities in Requirement 3 to verify that roles and responsibilities are assigned as documented and are understood."
                  },
                  {
                    "id": "PCI-3.1.2_gdn",
                    "name": "guidance",
                    "prose": "Roles and responsibilities may be documented within policies and procedures or maintained within separate documents. As part of communicating roles and responsibilities, entities can consider having personnel acknowledge their acceptance and understanding of their assigned roles and responsibilities."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-3.2",
            "title": "Storage of account data is kept to a minimum.",
            "props": [
              {
                "name": "label",
                "value": "3.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-3.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.2.1_smt",
                    "name": "statement",
                    "prose": "Account data storage is kept to a minimum through implementation of data retention and disposal policies, procedures, and processes that include at least the following: \n* Coverage for all locations of stored account data. \n* Coverage for any sensitive authentication data (SAD) stored prior to completion of authorization. This bullet is a best practice until its effective date; refer to Applicability Notes below for details. \n* Limiting data storage amount and retention time to that which is required for legal or regulatory, and/or business requirements. \n* Specific retention requirements for stored account data that defines length of retention period and includes a documented business justification. \n* Processes for secure deletion or rendering account data unrecoverable when no longer needed per the retention policy. \n* A process for verifying, at least once every three months, that stored account data exceeding the defined retention period has been securely deleted or rendered unrecoverable."
                  },
                  {
                    "id": "PCI-3.2.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine the data retention and disposal policies, procedures, and processes and interview personnel to verify processes are defined to include all elements specified in this requirement.\nExamine files and system records on system components where account data is stored to verify that the data storage amount and retention time does not exceed the requirements defined in the data retention policy.\nObserve the mechanisms used to render account data unrecoverable to verify data cannot be recovered."
                  },
                  {
                    "id": "PCI-3.2.1_gdn",
                    "name": "guidance",
                    "prose": "When identifying locations of stored account data, consider all processes and personnel with access to the data, as data could have been moved and stored in different locations than originally defined. Storage locations that are often overlooked include backup and archive systems, removable data storage devices, paper-based media, and audio recordings. To define appropriate retention requirements, an entity first needs to understand its own business needs as well as any legal or regulatory obligations that apply to its industry or to the type of data being retained. Implementing an automated process to ensure data is automatically and securely deleted upon its defined retention limit can help ensure that account data is not retained beyond what is necessary for business, legal, or regulatory purposes. Methods of eliminating data when it exceeds the retention period include secure deletion to complete removal of the data or rendering it unrecoverable and unable to be reconstructed. Identifying and securely eliminating stored data that has exceeded its specified retention period prevents unnecessary retention of data that is no longer needed. This process may be automated, manual, or a combination of both. The deletion function in most operating systems is not “secure deletion” as it allows deleted data to be recovered, so instead, a dedicated secure deletion function or application must be used to make data unrecoverable. Remember, if you don't need it, don't store it!"
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-3.3",
            "title": "Sensitive authentication data (SAD) is not stored after authorization.",
            "props": [
              {
                "name": "label",
                "value": "3.3"
              }
            ],
            "controls": [
              {
                "id": "PCI-3.3.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.3.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.3.1_smt",
                    "name": "statement",
                    "prose": "SAD is not retained after authorization, even if encrypted. All sensitive authentication data received is rendered unrecoverable upon completion of the authorization process."
                  },
                  {
                    "id": "PCI-3.3.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "If SAD is received, examine documented policies, procedures, and system configurations to verify the data is not retained after authorization.\nIf SAD is received, examine the documented procedures and observe the secure data deletion processes to verify the data is rendered unrecoverable upon completion of the authorization process."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-3.3.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "3.3.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-3.3.1.1_smt",
                        "name": "statement",
                        "prose": "The full contents of any track are not retained upon completion of the authorization process."
                      },
                      {
                        "id": "PCI-3.3.1.1_testing-procedures",
                        "name": "testing-procedures",
                        "prose": "3.3.1.1 Examine data sources to verify that the full contents of any track are not stored upon completion of the authorization process."
                      }
                    ]
                  },
                  {
                    "id": "PCI-3.3.1.2",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "3.3.1.2"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-3.3.1.2_smt",
                        "name": "statement",
                        "prose": "The card verification code is not retained upon completion of the authorization process."
                      },
                      {
                        "id": "PCI-3.3.1.2_testing-procedures",
                        "name": "testing-procedures",
                        "prose": "3.3.1.2 Examine data sources, to verify that the card verification code is not stored upon completion of the authorization process."
                      }
                    ]
                  },
                  {
                    "id": "PCI-3.3.1.3",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "3.3.1.3"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-3.3.1.3_smt",
                        "name": "statement",
                        "prose": "The personal identification number (PIN) and the PIN block are not retained upon completion of the authorization process."
                      },
                      {
                        "id": "PCI-3.3.1.3_testing-procedures",
                        "name": "testing-procedures",
                        "prose": "3.3.1.3 Examine data sources, to verify that PINs and PIN blocks are not stored upon completion of the authorization process."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-3.3.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.3.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.3.2_smt",
                    "name": "statement",
                    "prose": "SAD that is stored electronically prior to completion of authorization is encrypted using strong cryptography."
                  },
                  {
                    "id": "PCI-3.3.2_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "3.3.2 Examine data stores, system configurations, and/or vendor documentation to verify that all SAD that is stored electronically prior to completion of authorization is encrypted using strong cryptography."
                  },
                  {
                    "id": "PCI-3.3.2_gdn",
                    "name": "guidance",
                    "prose": "Entities should consider encrypting SAD with a different cryptographic key than is used to encrypt PAN. Note that this does not mean that PAN present in SAD (as part of track data) would need to be separately encrypted."
                  }
                ]
              },
              {
                "id": "PCI-3.3.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.3.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.3.3_smt",
                    "name": "statement",
                    "prose": "Additional requirement for issuers and companies that support issuing services and store sensitive authentication data: Any storage of sensitive authentication data is: \n* Limited to that which is needed for a legitimate issuing business need and is secured. \n* Encrypted using strong cryptography."
                  },
                  {
                    "id": "PCI-3.3.3_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Additional testing procedure for issuers and companies that support issuing services and store sensitive authentication data: Examine documented policies and interview personnel to verify there is a documented business justification for the storage of sensitive authentication data.\nAdditional testing procedure for issuers and companies that support issuing services and store sensitive authentication data: Examine data stores and system configurations to verify that the sensitive authentication data is stored securely."
                  },
                  {
                    "id": "PCI-3.3.3_gdn",
                    "name": "guidance",
                    "prose": "Entities should consider encrypting SAD with a different cryptographic key than is used to encrypt PAN. Note that this does not mean that PAN present in SAD (as part of track data) would need to be separately encrypted."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-3.4",
            "title": "Access to displays of full PAN and ability to copy PAN is restricted.",
            "props": [
              {
                "name": "label",
                "value": "3.4"
              }
            ],
            "controls": [
              {
                "id": "PCI-3.4.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.4.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.4.1_smt",
                    "name": "statement",
                    "prose": "PAN is masked when displayed (the BIN and last four digits are the maximum number of digits to be displayed), such that only personnel with a legitimate business need can see more than the BIN and last four digits of the PAN."
                  },
                  {
                    "id": "PCI-3.4.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine documented policies and procedures for masking the display of PANs to verify: \n* A list of roles that need access to more than the BIN and last four digits of the PAN (includes full PAN) is documented, together with a legitimate business need for each role to have such access. \n* PAN is masked when displayed such that only personnel with a legitimate business need can see more than the BIN and last four digits of the PAN. \n* All roles not specifically authorized to see the full PAN must only see masked PANs.\nExamine system configurations to verify that full PAN is only displayed for roles with a documented business need, and that PAN is masked for all other requests.\nExamine displays of PAN (for example, on screen, on paper receipts) to verify that PANs are masked when displayed, and that only those with a legitimate business need are able to see more than the BIN and/or last four digits of the PAN."
                  },
                  {
                    "id": "PCI-3.4.1_gdn",
                    "name": "guidance",
                    "prose": "Applying access controls according to defined roles is one way to limit access to viewing full PAN to only those individuals with a defined business need. The masking approach should always display only the number of digits needed to perform a specific business function. For example, if only the last four digits are needed to perform a business function, PAN should be masked to only show the last four digits. As another example, if a function needs to view to the bank identification number (BIN) for routing purposes, unmask only the BIN digits for that function."
                  }
                ]
              },
              {
                "id": "PCI-3.4.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.4.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.4.2_smt",
                    "name": "statement",
                    "prose": "When using remote-access technologies, technical controls prevent copy and/or relocation of PAN for all personnel, except for those with documented, explicit authorization and a legitimate, defined business need."
                  },
                  {
                    "id": "PCI-3.4.2_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine documented policies and procedures and documented evidence for technical controls that prevent copy and/or relocation of PAN when using remote-access technologies onto local hard drives or removable electronic media to verify the following: \n* Technical controls prevent all personnel not specifically authorized from copying and/or relocating PAN. \n* A list of personnel with permission to copy and/or relocate PAN is maintained, together with the documented, explicit authorization and legitimate, defined business need.\nExamine configurations for remote-access technologies to verify that technical controls to prevent copy and/or relocation of PAN for all personnel, unless explicitly authorized.\nObserve processes and interview personnel to verify that only personnel with documented, explicit authorization and a legitimate, defined business need have permission to copy and/or relocate PAN when using remote- access technologies."
                  },
                  {
                    "id": "PCI-3.4.2_gdn",
                    "name": "guidance",
                    "prose": "Copying and relocation of PAN should only be done to storage devices that are permissible and authorized for that individual."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-3.5",
            "title": "Primary account number (PAN) is secured wherever it is stored.",
            "props": [
              {
                "name": "label",
                "value": "3.5"
              }
            ],
            "controls": [
              {
                "id": "PCI-3.5.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.5.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.5.1_smt",
                    "name": "statement",
                    "prose": "PAN is rendered unreadable anywhere it is stored by using any of the following approaches: \n* One-way hashes based on strong cryptography of the entire PAN. \n* Truncation (hashing cannot be used to replace the truncated segment of PAN). \n    * If hashed and truncated versions of the same PAN, or different truncation formats of the same PAN, are present in an environment, additional controls are in place such that the different versions cannot be correlated to reconstruct the original PAN. \n* Index tokens. \n* Strong cryptography with associated keymanagement processes and procedures."
                  },
                  {
                    "id": "PCI-3.5.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine documentation about the system used to render PAN unreadable, including the vendor, type of system/process, and the encryption algorithms (if applicable) to verify that the PAN is rendered unreadable using any of the methods specified in this requirement.\nExamine data repositories and audit logs, including payment application logs, to verify the PAN is rendered unreadable using any of the methods specified in this requirement.\nIf hashed and truncated versions of the same PAN are present in the environment, examine implemented controls to verify that the hashed and truncated versions cannot be correlated to reconstruct the original PAN."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-3.5.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "3.5.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-3.5.1.1_smt",
                        "name": "statement",
                        "prose": "Hashes used to render PAN unreadable (per the first bullet of Requirement 3.5.1) are keyed cryptographic hashes of the entire PAN, with associated key-management processes and procedures in accordance with Requirements 3.6 and 3.7."
                      },
                      {
                        "id": "PCI-3.5.1.1_testing-procedures",
                        "name": "testing-procedures",
                        "prose": "Examine documentation about the hashing method used to render PAN unreadable, including the vendor, type of system/process, and the encryption algorithms (as applicable) to verify that the hashing method results in keyed cryptographic hashes of the entire PAN, with associated key management processes and procedures.\nExamine documentation about the key management procedures and processes associated with the keyed cryptographic hashes to verify keys are managed in accordance with Requirements 3.6 and 3.7.\nExamine data repositories to verify the PAN is rendered unreadable.\nExamine audit logs, including payment application logs, to verify the PAN is rendered unreadable."
                      },
                      {
                        "id": "PCI-3.5.1.1_gdn",
                        "name": "guidance",
                        "prose": "A hashing function that incorporates a randomly generated secret key provides brute force attack resistance and secret authentication integrity."
                      }
                    ]
                  },
                  {
                    "id": "PCI-3.5.1.2",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "3.5.1.2"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-3.5.1.2_smt",
                        "name": "statement",
                        "prose": "If disk-level or partition-level encryption (rather than file-, column-, or field-level database encryption) is used to render PAN unreadable, it is implemented only as follows: \n* On removable electronic media\nOR\n\n* If used for non-removable electronic media, PAN is also rendered unreadable via another mechanism that meets Requirement 3.5.1."
                      },
                      {
                        "id": "PCI-3.5.1.2_testing-procedures",
                        "name": "testing-procedures",
                        "prose": "Examine encryption processes to verify that, if disk-level or partition-level encryption is used to render PAN unreadable, it is implemented only as follows: \n* On removable electronic media, OR \n* If used for non-removable electronic media, examine encryption processes used to verify that PAN is also rendered unreadable via another method that meets Requirement 3.5.1.\nExamine configurations and/or vendor documentation and observe encryption processes to verify the system is configured according to vendor documentation the result is that the disk or the partition is rendered unreadable."
                      }
                    ]
                  },
                  {
                    "id": "PCI-3.5.1.3",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "3.5.1.3"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-3.5.1.3_smt",
                        "name": "statement",
                        "prose": "If disk-level or partition-level encryption is used (rather than file-, column-, or field--level database encryption) to render PAN unreadable, it is managed as follows: \n* Logical access is managed separately and independently of native operating system authentication and access control mechanisms. \n* Decryption keys are not associated with user accounts. \n* Authentication factors (passwords, passphrases, or cryptographic keys) that allow access to unencrypted data are stored securely."
                      },
                      {
                        "id": "PCI-3.5.1.3_testing-procedures",
                        "name": "testing-procedures",
                        "prose": "If disk-level or partition-level encryption is used to render PAN unreadable, examine the system configuration and observe the authentication process to verify that logical access is implemented in accordance with all elements specified in this requirement.\nExamine files containing authentication factors (passwords, passphrases, or cryptographic keys) and interview personnel to verify that authentication factors that allow access to unencrypted data are stored securely and are independent from the native operating system’s authentication and access control methods."
                      },
                      {
                        "id": "PCI-3.5.1.3_gdn",
                        "name": "guidance",
                        "prose": "Full disk encryption helps to protect data in the event of physical loss of a disk and therefore its use is best limited only to removable electronic media storage devices."
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-3.6",
            "title": "Cryptographic keys used to protect stored account data are secured.",
            "props": [
              {
                "name": "label",
                "value": "3.6"
              }
            ],
            "controls": [
              {
                "id": "PCI-3.6.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.6.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.6.1_smt",
                    "name": "statement",
                    "prose": "Procedures are defined and implemented to protect cryptographic keys used to protect stored account data against disclosure and misuse that include: \n* Access to keys is restricted to the fewest number of custodians necessary. \n* Key-encrypting keys are at least as strong as the data-encrypting keys they protect. \n* Key-encrypting keys are stored separately from data-encrypting keys. \n* Keys are stored securely in the fewest possible locations and forms."
                  },
                  {
                    "id": "PCI-3.6.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "3.6.1 Examine documented key-management policies and procedures to verify that processes to protect cryptographic keys used to protect stored account data against disclosure and misuse are defined to include all elements specified in this requirement."
                  },
                  {
                    "id": "PCI-3.6.1_gdn",
                    "name": "guidance",
                    "prose": "Having a centralized key management system based on industry standards is recommended for managing cryptographic keys."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-3.6.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "3.6.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-3.6.1.1_smt",
                        "name": "statement",
                        "prose": "Additional requirement for service providers only: A documented description of the cryptographic architecture is maintained that includes: \n* Details of all algorithms, protocols, and keys used for the protection of stored account data, including key strength and expiry date. \n* Preventing the use of the same cryptographic keys in production and test environments. This bullet is a best practice until its effective date; refer to Applicability Notes below for details. \n* Description of the key usage for each key. \n* Inventory of any hardware security modules (HSMs), key management systems (KMS), and other secure cryptographic devices (SCDs) used for key management, including type and location of devices, as outlined in Requirement 12.3.4."
                      },
                      {
                        "id": "PCI-3.6.1.1_testing-procedures",
                        "name": "testing-procedures",
                        "prose": "3.6.1.1 Additional testing procedure for service provider assessments only: Interview responsible personnel and examine documentation to verify that a document exists to describe the cryptographic architecture that includes all elements specified in this requirement."
                      },
                      {
                        "id": "PCI-3.6.1.1_gdn",
                        "name": "guidance",
                        "prose": "Having an automated reporting mechanism can assist with maintenance of the cryptographic attributes."
                      }
                    ]
                  },
                  {
                    "id": "PCI-3.6.1.2",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "3.6.1.2"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-3.6.1.2_smt",
                        "name": "statement",
                        "prose": "Secret and private keys used to encrypt/decrypt stored account data are stored in one (or more) of the following forms at all times: \n* Encrypted with a key-encrypting key that is at least as strong as the data-encrypting key, and that is stored separately from the dataencrypting key. \n* Within a secure cryptographic device (SCD), such as a hardware security module (HSM) or PTS-approved point-of-interaction device. \n* As at least two full-length key components or key shares, in accordance with an industry-accepted method."
                      },
                      {
                        "id": "PCI-3.6.1.2_testing-procedures",
                        "name": "testing-procedures",
                        "prose": "Examine documented procedures to verify it is defined that cryptographic keys used to encrypt/decrypt stored account data must exist only in one (or more) of the forms specified in this requirement.\nExamine system configurations and key storage locations to verify that cryptographic keys used to encrypt/decrypt stored account data exist in one (or more) of the forms specified in this requirement.\nWherever key-encrypting keys are used, examine system configurations and key storage locations to verify: \n* Key-encrypting keys are at least as strong as the data-encrypting keys they protect. \n* Key-encrypting keys are stored separately from data-encrypting keys."
                      },
                      {
                        "id": "PCI-3.6.1.2_gdn",
                        "name": "guidance",
                        "prose": "Where data-encrypting keys are stored in an HSM, the HSM interaction channel should be protected to prevent interception of encryption or decryption operations."
                      }
                    ]
                  },
                  {
                    "id": "PCI-3.6.1.3",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "3.6.1.3"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-3.6.1.3_smt",
                        "name": "statement",
                        "prose": "Access to cleartext cryptographic key components is restricted to the fewest number of custodians necessary."
                      },
                      {
                        "id": "PCI-3.6.1.3_testing-procedures",
                        "name": "testing-procedures",
                        "prose": "3.6.1.3 Examine user access lists to verify that access to cleartext cryptographic key components is restricted to the fewest number of custodians necessary."
                      },
                      {
                        "id": "PCI-3.6.1.3_gdn",
                        "name": "guidance",
                        "prose": "Only personnel with defined key custodian responsibilities (creating, altering, rotating, distributing, or otherwise maintaining encryption keys) should be granted access to key components. Ideally this will be a very small number of people."
                      }
                    ]
                  },
                  {
                    "id": "PCI-3.6.1.4",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "3.6.1.4"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-3.6.1.4_smt",
                        "name": "statement",
                        "prose": "Cryptographic keys are stored in the fewest possible locations."
                      },
                      {
                        "id": "PCI-3.6.1.4_testing-procedures",
                        "name": "testing-procedures",
                        "prose": "3.6.1.4 Examine key storage locations and observe processes to verify that keys are stored in the fewest possible locations."
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-3.7",
            "title": "Where cryptography is used to protect stored account data, key management processes and procedures covering all aspects of the key lifecycle are defined and implemented.",
            "props": [
              {
                "name": "label",
                "value": "3.7"
              }
            ],
            "controls": [
              {
                "id": "PCI-3.7.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.7.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.7.1_smt",
                    "name": "statement",
                    "prose": "Key-management policies and procedures are implemented to include generation of strong cryptographic keys used to protect stored account data."
                  },
                  {
                    "id": "PCI-3.7.1_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine the documented key-management policies and procedures for keys used for protection of stored account data to verify that they define generation of strong cryptographic keys.\nObserve the method for generating keys to verify that strong keys are generated."
                  }
                ]
              },
              {
                "id": "PCI-3.7.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.7.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.7.2_smt",
                    "name": "statement",
                    "prose": "Key-management policies and procedures are implemented to include secure distribution of cryptographic keys used to protect stored account data."
                  },
                  {
                    "id": "PCI-3.7.2_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine the documented key-management policies and procedures for keys used for protection of stored account data to verify that they define secure distribution of cryptographic keys.\nObserve the method for distributing keys to verify that keys are distributed securely."
                  }
                ]
              },
              {
                "id": "PCI-3.7.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.7.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.7.3_smt",
                    "name": "statement",
                    "prose": "Key-management policies and procedures are implemented to include secure storage of cryptographic keys used to protect stored account data."
                  },
                  {
                    "id": "PCI-3.7.3_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine the documented key-management policies and procedures for keys used for protection of stored account data to verify that they define secure storage of cryptographic keys.\nObserve the method for storing keys to verify that keys are stored securely."
                  },
                  {
                    "id": "PCI-3.7.3_gdn",
                    "name": "guidance",
                    "prose": "Data encryption keys can be protected by encrypting them with a key-encrypting key. Keys can be stored in a Hardware Security Module (HSM). Secret or private keys that can decrypt data should never be present in source code."
                  }
                ]
              },
              {
                "id": "PCI-3.7.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.7.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.7.4_smt",
                    "name": "statement",
                    "prose": "Key management policies and procedures are implemented for cryptographic key changes for keys that have reached the end of their cryptoperiod, as defined by the associated application vendor or key owner, and based on industry best practices and guidelines, including the following: \n* A defined cryptoperiod for each key type in use. \n* A process for key changes at the end of the defined cryptoperiod."
                  },
                  {
                    "id": "PCI-3.7.4_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine the documented key-management policies and procedures for keys used for protection of stored account data to verify that they define changes to cryptographic keys that have reached the end of their cryptoperiod and include all elements specified in this requirement.\nInterview personnel, examine documentation, and observe key storage locations to verify that keys are changed at the end of the defined cryptoperiod(s)."
                  }
                ]
              },
              {
                "id": "PCI-3.7.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.7.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.7.5_smt",
                    "name": "statement",
                    "prose": "Key management policies procedures are implemented to include the retirement, replacement, or destruction of keys used to protect stored account data, as deemed necessary when: \n* The key has reached the end of its defined cryptoperiod. \n* The integrity of the key has been weakened, including when personnel with knowledge of a cleartext key component leaves the company, or the role for which the key component was known. \n* The key is suspected of or known to be compromised. Retired or replaced keys are not used for encryption operations."
                  },
                  {
                    "id": "PCI-3.7.5_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine the documented key-management policies and procedures for keys used for protection of stored account data and verify that they define retirement, replacement, or destruction of keys in accordance with all elements specified in this requirement.\nInterview personnel to verify that processes are implemented in accordance with all elements specified in this requirement."
                  },
                  {
                    "id": "PCI-3.7.5_gdn",
                    "name": "guidance",
                    "prose": "Archived cryptographic keys should be used only for decryption/verification purposes. The encryption solution should provide for and facilitate a process to replace keys that are due for replacement or that are known to be, or suspected of being, compromised. In addition, any keys that are known to be, or suspected of being, compromised should be managed in accordance with the entity’s incident response plan per Requirement 12.10.1."
                  }
                ]
              },
              {
                "id": "PCI-3.7.6",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.7.6"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.7.6_smt",
                    "name": "statement",
                    "prose": "Where manual cleartext cryptographic keymanagement operations are performed by personnel, key-management policies and procedures are implemented include managing these operations using split knowledge and dual control."
                  },
                  {
                    "id": "PCI-3.7.6_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine the documented key-management policies and procedures for keys used for protection of stored account data and verify that they define using split knowledge and dual control.\nInterview personnel and/or observe processes to verify that manual cleartext keys are managed with split knowledge and dual control."
                  },
                  {
                    "id": "PCI-3.7.6_gdn",
                    "name": "guidance",
                    "prose": "Where key components or key shares are used, procedures should ensure that no single custodian ever has access to sufficient key components or shares to reconstruct the cryptographic key. For example, in an m-of-n scheme (for example, Shamir), where only two of any three components are required to reconstruct the cryptographic key, a custodian must not have current or prior knowledge of more than one component. If a custodian was previously assigned component A, which was then reassigned, the custodian should not then be assigned component B or C, as this would give the custodian knowledge of two components and the ability to recreate the key. Examples Key-management operations that might be performed manually include, but are not limited to, key generation, transmission, loading, storage, and destruction."
                  }
                ]
              },
              {
                "id": "PCI-3.7.7",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.7.7"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.7.7_smt",
                    "name": "statement",
                    "prose": "Key management policies and procedures are implemented to include the prevention of unauthorized substitution of cryptographic keys."
                  },
                  {
                    "id": "PCI-3.7.7_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine the documented key-management policies and procedures for keys used for protection of stored account data and verify that they define prevention of unauthorized substitution of cryptographic keys.\nInterview personnel and/or observe processes to verify that unauthorized substitution of keys is prevented."
                  },
                  {
                    "id": "PCI-3.7.7_gdn",
                    "name": "guidance",
                    "prose": "The encryption solution should not allow for or accept substitution of keys from unauthorized sources or unexpected processes. Controls should include ensuring that individuals with access to key components or shares do not have access to other components or shares that form the necessary threshold to derive the key."
                  }
                ]
              },
              {
                "id": "PCI-3.7.8",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.7.8"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.7.8_smt",
                    "name": "statement",
                    "prose": "Key management policies and procedures are implemented to include that cryptographic key custodians formally acknowledge (in writing or electronically) that they understand and accept their key-custodian responsibilities."
                  },
                  {
                    "id": "PCI-3.7.8_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "Examine the documented key-management policies and procedures for keys used for protection of stored account data and verify that they define acknowledgments for key custodians in accordance with all elements specified in this requirement.\nExamine documentation or other evidence showing that key custodians have provided acknowledgments in accordance with all elements specified in this requirement."
                  }
                ]
              },
              {
                "id": "PCI-3.7.9",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "3.7.9"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-3.7.9_smt",
                    "name": "statement",
                    "prose": "Additional requirement for service providers only: Where a service provider shares cryptographic keys with its customers for transmission or storage of account data, guidance on secure transmission, storage and updating of such keys is documented and distributed to the service provider’s customers."
                  },
                  {
                    "id": "PCI-3.7.9_testing-procedures",
                    "name": "testing-procedures",
                    "prose": "3.7.9 Additional testing procedure for service provider assessments only: If the service provider shares cryptographic keys with its customers for transmission or storage of account data, examine the documentation that the service provider provides to its customers to verify it includes guidance on how to securely transmit, store, and update customers’ keys in accordance with all elements specified in Requirements 3.7.1 through 3.7.8 above."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-4",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "4"
          }
        ],
        "groups": [
          {
            "id": "PCI-4.1",
            "title": "Processes and mechanisms for protecting cardholder data with strong cryptography during transmission over open, public networks are defined and documented.",
            "props": [
              {
                "name": "label",
                "value": "4.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-4.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "4.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-4.1.1_smt",
                    "name": "statement",
                    "prose": "All security policies and operational procedures that are identified in Requirement 4 are: \n* Documented. \n* Kept up to date. \n* In use. \n* Known to all affected parties."
                  }
                ]
              },
              {
                "id": "PCI-4.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "4.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-4.1.2_smt",
                    "name": "statement",
                    "prose": "Roles and responsibilities for performing activities in Requirement 4 are documented, assigned, and understood."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-4.2",
            "title": "PAN is protected with strong cryptography during transmission.",
            "props": [
              {
                "name": "label",
                "value": "4.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-4.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "4.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-4.2.1_smt",
                    "name": "statement",
                    "prose": "Strong cryptography and security protocols are implemented as follows to safeguard PAN during transmission over open, public networks: \n* Only trusted keys and certificates are accepted. \n* Certificates used to safeguard PAN during transmission over open, public networks are confirmed as valid and are not expired or revoked. This bullet is a best practice until its effective date; refer to applicability notes below for details. \n* The protocol in use supports only secure versions or configurations and does not support fallback to, or use of insecure versions, algorithms, key sizes, or implementations. \n* The encryption strength is appropriate for the encryption methodology in use."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-4.2.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "4.2.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-4.2.1.1_smt",
                        "name": "statement",
                        "prose": "An inventory of the entity’s trusted keys and certificates used to protect PAN during transmission is maintained."
                      }
                    ]
                  },
                  {
                    "id": "PCI-4.2.1.2",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "4.2.1.2"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-4.2.1.2_smt",
                        "name": "statement",
                        "prose": "Wireless networks transmitting PAN or connected to the CDE use industry best practices to implement strong cryptography for authentication and transmission."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-4.2.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "4.2.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-4.2.2_smt",
                    "name": "statement",
                    "prose": "PAN is secured with strong cryptography whenever it is sent via end-user messaging technologies."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-5",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "5"
          }
        ],
        "groups": [
          {
            "id": "PCI-5.1",
            "title": "Processes and mechanisms for protecting all systems and networks from malicious software are defined and understood.",
            "props": [
              {
                "name": "label",
                "value": "5.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-5.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "5.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-5.1.1_smt",
                    "name": "statement",
                    "prose": "All security policies and operational procedures that are identified in Requirement 5 are: \n* Documented. \n* Kept up to date. \n* In use. \n* Known to all affected parties."
                  }
                ]
              },
              {
                "id": "PCI-5.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "5.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-5.1.2_smt",
                    "name": "statement",
                    "prose": "Roles and responsibilities for performing activities in Requirement 5 are documented, assigned, and understood."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-5.2",
            "title": "Malicious software (malware) is prevented, or detected and addressed.",
            "props": [
              {
                "name": "label",
                "value": "5.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-5.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "5.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-5.2.1_smt",
                    "name": "statement",
                    "prose": "An anti-malware solution(s) is deployed on all system components, except for those system components identified in periodic evaluations per Requirement 5.2.3 that concludes the system components are not at risk from malware."
                  }
                ]
              },
              {
                "id": "PCI-5.2.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "5.2.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-5.2.2_smt",
                    "name": "statement",
                    "prose": "The deployed anti-malware solution(s): \n* Detects all known types of malware. \n* Removes, blocks, or contains all known types of malware."
                  }
                ]
              },
              {
                "id": "PCI-5.2.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "5.2.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-5.2.3_smt",
                    "name": "statement",
                    "prose": "Any system components that are not at risk for malware are evaluated periodically to include the following: \n* A documented list of all system components not at risk for malware. \n* Identification and evaluation of evolving malware threats for those system components. \n* Confirmation whether such system components continue to not require anti-malware protection."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-5.2.3.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "5.2.3.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-5.2.3.1_smt",
                        "name": "statement",
                        "prose": "The frequency of periodic evaluations of system components identified as not at risk for malware is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1."
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-5.3",
            "title": "Anti-malware mechanisms and processes are active, maintained, and monitored.",
            "props": [
              {
                "name": "label",
                "value": "5.3"
              }
            ],
            "controls": [
              {
                "id": "PCI-5.3.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "5.3.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-5.3.1_smt",
                    "name": "statement",
                    "prose": "The anti-malware solution(s) is kept current via automatic updates."
                  }
                ]
              },
              {
                "id": "PCI-5.3.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "5.3.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-5.3.2_smt",
                    "name": "statement",
                    "prose": "The anti-malware solution(s): \n* Performs periodic scans and active or real-time scans.\nOR\n\n* Performs continuous behavioral analysis of systems or processes."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-5.3.2.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "5.3.2.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-5.3.2.1_smt",
                        "name": "statement",
                        "prose": "If periodic malware scans are performed to meet Requirement 5.3.2, the frequency of scans is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-5.3.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "5.3.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-5.3.3_smt",
                    "name": "statement",
                    "prose": "For removable electronic media, the antimalware solution(s): \n* Performs automatic scans of when the media is inserted, connected, or logically mounted,\nOR\n\n* Performs continuous behavioral analysis of systems or processes when the media is inserted, connected, or logically mounted."
                  }
                ]
              },
              {
                "id": "PCI-5.3.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "5.3.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-5.3.4_smt",
                    "name": "statement",
                    "prose": "Audit logs for the anti-malware solution(s) are enabled and retained in accordance with Requirement 10.5.1."
                  }
                ]
              },
              {
                "id": "PCI-5.3.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "5.3.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-5.3.5_smt",
                    "name": "statement",
                    "prose": "Anti-malware mechanisms cannot be disabled or altered by users, unless specifically documented, and authorized by management on a case-by-case basis for a limited time period."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-5.4",
            "title": "Anti-phishing mechanisms protect users against phishing attacks.",
            "props": [
              {
                "name": "label",
                "value": "5.4"
              }
            ],
            "controls": [
              {
                "id": "PCI-5.4.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "5.4.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-5.4.1_smt",
                    "name": "statement",
                    "prose": "Processes and automated mechanisms are in place to detect and protect personnel against phishing attacks."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-6",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "6"
          }
        ],
        "groups": [
          {
            "id": "PCI-6.1",
            "title": "Processes and mechanisms for developing and maintaining secure systems and software are defined and understood.",
            "props": [
              {
                "name": "label",
                "value": "6.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-6.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.1.1_smt",
                    "name": "statement",
                    "prose": "All security policies and operational procedures that are identified in Requirement 6 are: \n* Documented. \n* Kept up to date. \n* In use. \n* Known to all affected parties."
                  }
                ]
              },
              {
                "id": "PCI-6.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.1.2_smt",
                    "name": "statement",
                    "prose": "Roles and responsibilities for performing activities in Requirement 6 are documented, assigned, and understood."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-6.2",
            "title": "Bespoke and custom software are developed securely.",
            "props": [
              {
                "name": "label",
                "value": "6.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-6.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.2.1_smt",
                    "name": "statement",
                    "prose": "Bespoke and custom software are developed securely, as follows: \n* Based on industry standards and/or best practices for secure development. \n* In accordance with PCI DSS (for example, secure authentication and logging). \n* Incorporating consideration of information security issues during each stage of the software development lifecycle."
                  }
                ]
              },
              {
                "id": "PCI-6.2.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.2.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.2.2_smt",
                    "name": "statement",
                    "prose": "Software development personnel working on bespoke and custom software are trained at least once every 12 months as follows: \n* On software security relevant to their job function and development languages. \n* Including secure software design and secure coding techniques. \n* Including, if security testing tools are used, how to use the tools for detecting vulnerabilities in software."
                  }
                ]
              },
              {
                "id": "PCI-6.2.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.2.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.2.3_smt",
                    "name": "statement",
                    "prose": "Bespoke and custom software is reviewed prior to being released into production or to customers, to identify and correct potential coding vulnerabilities, as follows: \n* Code reviews ensure code is developed according to secure coding guidelines. \n* Code reviews look for both existing and emerging software vulnerabilities. \n* Appropriate corrections are implemented prior to release."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-6.2.3.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "6.2.3.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-6.2.3.1_smt",
                        "name": "statement",
                        "prose": "If manual code reviews are performed for bespoke and custom software prior to release to production, code changes are: \n* Reviewed by individuals other than the originating code author, and who are knowledgeable about code-review techniques and secure coding practices. \n* Reviewed and approved by management prior to release."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-6.2.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.2.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.2.4_smt",
                    "name": "statement",
                    "prose": "Software engineering techniques or other methods are defined and in use by software development personnel to prevent or mitigate common software attacks and related vulnerabilities in bespoke and custom software, including but not limited to the following: \n* Injection attacks, including SQL, LDAP, XPath, or other command, parameter, object, fault, or injection-type flaws. \n* Attacks on data and data structures, including attempts to manipulate buffers, pointers, input data, or shared data. \n* Attacks on cryptography usage, including attempts to exploit weak, insecure, or inappropriate cryptographic implementations, algorithms, cipher suites, or modes of operation. \n* Attacks on business logic, including attempts to abuse or bypass application features and functionalities through the manipulation of APIs, communication protocols and channels, clientside functionality, or other system/application functions and resources. This includes cross-site scripting (XSS) and cross-site request forgery (CSRF). \n* Attacks on access control mechanisms, including attempts to bypass or abuse identification, authentication, or authorization mechanisms, or attempts to exploit weaknesses in the implementation of such mechanisms. \n* Attacks via any “high-risk” vulnerabilities identified in the vulnerability identification process, as defined in Requirement 6.3.1"
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-6.3",
            "title": "Security vulnerabilities are identified and addressed.",
            "props": [
              {
                "name": "label",
                "value": "6.3"
              }
            ],
            "controls": [
              {
                "id": "PCI-6.3.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.3.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.3.1_smt",
                    "name": "statement",
                    "prose": "Security vulnerabilities are identified and managed as follows: \n* New security vulnerabilities are identified using industry-recognized sources for security vulnerability information, including alerts from international and national computer emergency response teams (CERTs). \n* Vulnerabilities are assigned a risk ranking based on industry best practices and consideration of potential impact. \n* Risk rankings identify, at a minimum, all vulnerabilities considered to be a high-risk or critical to the environment. \n* Vulnerabilities for bespoke and custom, and third-party software (for example operating systems and databases) are covered."
                  }
                ]
              },
              {
                "id": "PCI-6.3.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.3.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.3.2_smt",
                    "name": "statement",
                    "prose": "An inventory of bespoke and custom software, and third-party software components incorporated into bespoke and custom software is maintained to facilitate vulnerability and patch management."
                  }
                ]
              },
              {
                "id": "PCI-6.3.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.3.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.3.3_smt",
                    "name": "statement",
                    "prose": "All system components are protected from known vulnerabilities by installing applicable security patches/updates as follows: \n* Critical or high-security patches/updates (identified according to the risk ranking process at Requirement 6.3.1) are installed within one month of release. \n* All other applicable security patches/updates are installed within an appropriate time frame as determined by the entity (for example, within three months of release)."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-6.4",
            "title": "Public-facing web applications are protected against attacks.",
            "props": [
              {
                "name": "label",
                "value": "6.4"
              }
            ],
            "controls": [
              {
                "id": "PCI-6.4.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.4.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.4.1_smt",
                    "name": "statement",
                    "prose": "For public-facing web applications, new threats and vulnerabilities are addressed on an ongoing basis and these applications are protected against known attacks as follows: \n* Reviewing public-facing web applications via manual or automated application vulnerability security assessment tools or methods as follows: \n    * At least once every 12 months and after significant changes. \n    * By an entity that specializes in application security. \n    * Including, at a minimum, all common software attacks in Requirement 6.2.4. \n    * All vulnerabilities are ranked in accordance with requirement 6.3.1. \n    * All vulnerabilities are corrected. \n    * The application is re-evaluated after the corrections\nOR\n\n* Installing an automated technical solution(s) that continually detects and prevents web-based attacks as follows: \n    * Installed in front of public-facing web applications to detect and prevent webbased attacks. \n    * Actively running and up to date as applicable. \n    * Generating audit logs. \n    * Configured to either block web-based attacks or generate an alert that is immediately investigated."
                  }
                ]
              },
              {
                "id": "PCI-6.4.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.4.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.4.2_smt",
                    "name": "statement",
                    "prose": "For public-facing web applications, an automated technical solution is deployed that continually detects and prevents web-based attacks, with at least the following: \n* Is installed in front of public-facing web applications and is configured to detect and prevent web-based attacks. \n* Actively running and up to date as applicable. \n* Generating audit logs. \n* Configured to either block web-based attacks or generate an alert that is immediately investigated."
                  }
                ]
              },
              {
                "id": "PCI-6.4.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.4.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.4.3_smt",
                    "name": "statement",
                    "prose": "All payment page scripts that are loaded and executed in the consumer’s browser are managed as follows: \n* A method is implemented to confirm that each script is authorized. \n* A method is implemented to assure the integrity of each script. \n* An inventory of all scripts is maintained with written justification as to why each is necessary."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-6.5",
            "title": "Changes to all system components are managed securely.",
            "props": [
              {
                "name": "label",
                "value": "6.5"
              }
            ],
            "controls": [
              {
                "id": "PCI-6.5.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.5.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.5.1_smt",
                    "name": "statement",
                    "prose": "Changes to all system components in the production environment are made according to established procedures that include: \n* Reason for, and description of, the change. \n* Documentation of security impact. \n* Documented change approval by authorized parties. \n* Testing to verify that the change does not adversely impact system security. \n* For bespoke and custom software changes, all updates are tested for compliance with Requirement 6.2.4 before being deployed into production. \n* Procedures to address failures and return to a secure state."
                  }
                ]
              },
              {
                "id": "PCI-6.5.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.5.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.5.2_smt",
                    "name": "statement",
                    "prose": "Upon completion of a significant change, all applicable PCI DSS requirements are confirmed to be in place on all new or changed systems and networks, and documentation is updated as applicable."
                  }
                ]
              },
              {
                "id": "PCI-6.5.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.5.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.5.3_smt",
                    "name": "statement",
                    "prose": "Pre-production environments are separated from production environments and the separation is enforced with access controls."
                  }
                ]
              },
              {
                "id": "PCI-6.5.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.5.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.5.4_smt",
                    "name": "statement",
                    "prose": "Roles and functions are separated between production and pre-production environments to provide accountability such that only reviewed and approved changes are deployed."
                  }
                ]
              },
              {
                "id": "PCI-6.5.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.5.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.5.5_smt",
                    "name": "statement",
                    "prose": "Live PANs are not used in pre-production environments, except where those environments are included in the CDE and protected in accordance with all applicable PCI DSS requirements."
                  }
                ]
              },
              {
                "id": "PCI-6.5.6",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "6.5.6"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-6.5.6_smt",
                    "name": "statement",
                    "prose": "Test data and test accounts are removed from system components before the system goes into production."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-7",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "7"
          }
        ],
        "groups": [
          {
            "id": "PCI-7.1",
            "title": "Processes and mechanisms for restricting access to system components and cardholder data by business need to know are defined and understood.",
            "props": [
              {
                "name": "label",
                "value": "7.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-7.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "7.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-7.1.1_smt",
                    "name": "statement",
                    "prose": "All security policies and operational procedures that are identified in Requirement 7 are: \n* Documented. \n* Kept up to date. \n* In use. \n* Known to all affected parties."
                  }
                ]
              },
              {
                "id": "PCI-7.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "7.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-7.1.2_smt",
                    "name": "statement",
                    "prose": "Roles and responsibilities for performing activities in Requirement 7 are documented, assigned, and understood."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-7.2",
            "title": "Access to system components and data is appropriately defined and assigned.",
            "props": [
              {
                "name": "label",
                "value": "7.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-7.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "7.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-7.2.1_smt",
                    "name": "statement",
                    "prose": "An access control model is defined and includes granting access as follows: \n* Appropriate access depending on the entity’s business and access needs. \n* Access to system components and data resources that is based on users’ job classification and functions. \n* The least privileges required (for example, user, administrator) to perform a job function."
                  }
                ]
              },
              {
                "id": "PCI-7.2.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "7.2.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-7.2.2_smt",
                    "name": "statement",
                    "prose": "Access is assigned to users, including privileged users, based on: \n* Job classification and function. \n* Least privileges necessary to perform job responsibilities."
                  }
                ]
              },
              {
                "id": "PCI-7.2.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "7.2.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-7.2.3_smt",
                    "name": "statement",
                    "prose": "Required privileges are approved by authorized personnel."
                  }
                ]
              },
              {
                "id": "PCI-7.2.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "7.2.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-7.2.4_smt",
                    "name": "statement",
                    "prose": "All user accounts and related access privileges, including third-party/vendor accounts, are reviewed as follows: \n* At least once every six months. \n* To ensure user accounts and access remain appropriate based on job function. \n* Any inappropriate access is addressed. \n* Management acknowledges that access remains appropriate."
                  }
                ]
              },
              {
                "id": "PCI-7.2.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "7.2.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-7.2.5_smt",
                    "name": "statement",
                    "prose": "All application and system accounts and related access privileges are assigned and managed as follows: \n* Based on the least privileges necessary for the operability of the system or application. \n* Access is limited to the systems, applications, or processes that specifically require their use."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-7.2.5.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "7.2.5.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-7.2.5.1_smt",
                        "name": "statement",
                        "prose": "All access by application and system accounts and related access privileges are reviewed as follows: \n* Periodically (at the frequency defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1). \n* The application/system access remains appropriate for the function being performed. \n* Any inappropriate access is addressed. \n* Management acknowledges that access remains appropriate."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-7.2.6",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "7.2.6"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-7.2.6_smt",
                    "name": "statement",
                    "prose": "All user access to query repositories of stored cardholder data is restricted as follows: \n* Via applications or other programmatic methods, with access and allowed actions based on user roles and least privileges. \n* Only the responsible administrator(s) can directly access or query repositories of stored CHD."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-7.3",
            "title": "Access to system components and data is managed via an access control system(s).",
            "props": [
              {
                "name": "label",
                "value": "7.3"
              }
            ],
            "controls": [
              {
                "id": "PCI-7.3.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "7.3.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-7.3.1_smt",
                    "name": "statement",
                    "prose": "An access control system(s) is in place that restricts access based on a user’s need to know and covers all system components."
                  }
                ]
              },
              {
                "id": "PCI-7.3.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "7.3.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-7.3.2_smt",
                    "name": "statement",
                    "prose": "The access control system(s) is configured to enforce permissions assigned to individuals, applications, and systems based on job classification and function."
                  }
                ]
              },
              {
                "id": "PCI-7.3.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "7.3.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-7.3.3_smt",
                    "name": "statement",
                    "prose": "The access control system(s) is set to “deny all” by default."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-8",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "8"
          }
        ],
        "groups": [
          {
            "id": "PCI-8.1",
            "title": "Processes and mechanisms for identifying users and authenticating access to system components are defined and understood.",
            "props": [
              {
                "name": "label",
                "value": "8.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-8.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.1.1_smt",
                    "name": "statement",
                    "prose": "All security policies and operational procedures that are identified in Requirement 8 are: \n* Documented. \n* Kept up to date. \n* In use. \n* Known to all affected parties."
                  }
                ]
              },
              {
                "id": "PCI-8.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.1.2_smt",
                    "name": "statement",
                    "prose": "Roles and responsibilities for performing activities in Requirement 8 are documented, assigned, and understood."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-8.2",
            "title": "User identification and related accounts for users and administrators are strictly managed throughout an account’s lifecycle.",
            "props": [
              {
                "name": "label",
                "value": "8.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-8.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.2.1_smt",
                    "name": "statement",
                    "prose": "All users are assigned a unique ID before access to system components or cardholder data is allowed."
                  }
                ]
              },
              {
                "id": "PCI-8.2.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.2.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.2.2_smt",
                    "name": "statement",
                    "prose": "Group, shared, or generic accounts, or other shared authentication credentials are only used when necessary on an exception basis, and are managed as follows: \n* Account use is prevented unless needed for an exceptional circumstance. \n* Use is limited to the time needed for the exceptional circumstance. \n* Business justification for use is documented. \n* Use is explicitly approved by management. \n* Individual user identity is confirmed before access to an account is granted. \n* Every action taken is attributable to an individual user."
                  }
                ]
              },
              {
                "id": "PCI-8.2.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.2.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.2.3_smt",
                    "name": "statement",
                    "prose": "Additional requirement for service providers only: Service providers with remote access to customer premises use unique authentication factors for each customer premises"
                  }
                ]
              },
              {
                "id": "PCI-8.2.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.2.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.2.4_smt",
                    "name": "statement",
                    "prose": "Addition, deletion, and modification of user IDs, authentication factors, and other identifier objects are managed as follows: \n* Authorized with the appropriate approval. \n* Implemented with only the privileges specified on the documented approval."
                  }
                ]
              },
              {
                "id": "PCI-8.2.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.2.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.2.5_smt",
                    "name": "statement",
                    "prose": "Access for terminated users is immediately revoked."
                  }
                ]
              },
              {
                "id": "PCI-8.2.6",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.2.6"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.2.6_smt",
                    "name": "statement",
                    "prose": "Inactive user accounts are removed or disabled within 90 days of inactivity."
                  }
                ]
              },
              {
                "id": "PCI-8.2.7",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.2.7"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.2.7_smt",
                    "name": "statement",
                    "prose": "Accounts used by third parties to access, support, or maintain system components via remote access are managed as follows: \n* Enabled only during the time period needed and disabled when not in use. \n* Use is monitored for unexpected activity."
                  }
                ]
              },
              {
                "id": "PCI-8.2.8",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.2.8"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.2.8_smt",
                    "name": "statement",
                    "prose": "If a user session has been idle for more than 15 minutes, the user is required to re-authenticate to re-activate the terminal or session."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-8.3",
            "title": "Strong authentication for users and administrators is established and managed.",
            "props": [
              {
                "name": "label",
                "value": "8.3"
              }
            ],
            "controls": [
              {
                "id": "PCI-8.3.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.3.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.3.1_smt",
                    "name": "statement",
                    "prose": "All user access to system components for users and administrators is authenticated via at least one of the following authentication factors: \n* Something you know, such as a password or passphrase. \n* Something you have, such as a token device or smart card. \n* Something you are, such as a biometric element."
                  }
                ]
              },
              {
                "id": "PCI-8.3.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.3.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.3.2_smt",
                    "name": "statement",
                    "prose": "Strong cryptography is used to render all authentication factors unreadable during transmission and storage on all system components."
                  }
                ]
              },
              {
                "id": "PCI-8.3.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.3.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.3.3_smt",
                    "name": "statement",
                    "prose": "User identity is verified before modifying any authentication factor."
                  }
                ]
              },
              {
                "id": "PCI-8.3.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.3.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.3.4_smt",
                    "name": "statement",
                    "prose": "Invalid authentication attempts are limited by: \n* Locking out the user ID after not more than 10 attempts. \n* Setting the lockout duration to a minimum of 30 minutes or until the user’s identity is confirmed."
                  }
                ]
              },
              {
                "id": "PCI-8.3.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.3.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.3.5_smt",
                    "name": "statement",
                    "prose": "If passwords/passphrases are used as authentication factors to meet Requirement 8.3.1, they are set and reset for each user as follows: \n* Set to a unique value for first-time use and upon reset. \n* Forced to be changed immediately after the first use."
                  }
                ]
              },
              {
                "id": "PCI-8.3.6",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.3.6"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.3.6_smt",
                    "name": "statement",
                    "prose": "If passwords/passphrases are used as authentication factors to meet Requirement 8.3.1, they meet the following minimum level of complexity: \n* A minimum length of 12 characters (or IF the system does not support 12 characters, a minimum length of eight characters). \n* Contain both numeric and alphabetic characters."
                  }
                ]
              },
              {
                "id": "PCI-8.3.7",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.3.7"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.3.7_smt",
                    "name": "statement",
                    "prose": "Individuals are not allowed to submit a new password/passphrase that is the same as any of the last four passwords/passphrases used."
                  }
                ]
              },
              {
                "id": "PCI-8.3.8",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.3.8"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.3.8_smt",
                    "name": "statement",
                    "prose": "Authentication policies and procedures are documented and communicated to all users including: \n* Guidance on selecting strong authentication factors. \n* Guidance for how users should protect their authentication factors. \n* Instructions not to reuse previously used passwords/passphrases. \n* Instructions to change passwords/passphrases if there is any suspicion or knowledge that the password/passphrases have been compromised and how to report the incident."
                  }
                ]
              },
              {
                "id": "PCI-8.3.9",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.3.9"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.3.9_smt",
                    "name": "statement",
                    "prose": "If passwords/passphrases are used as the only authentication factor for user access (i.e., in any single-factor authentication implementation) then either: \n* Passwords/passphrases are changed at least once every 90 days,\nOR\n\n* The security posture of accounts is dynamically analyzed, and real-time access to resources is automatically determined accordingly."
                  }
                ]
              },
              {
                "id": "PCI-8.3.10",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.3.10"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.3.10_smt",
                    "name": "statement",
                    "prose": "Additional requirement for service providers only: If passwords/passphrases are used as the only authentication factor for customer user access to cardholder data (i.e., in any singlefactor authentication implementation), then guidance is provided to customer users including: \n* Guidance for customers to change their user passwords/passphrases periodically. \n* Guidance as to when, and under what circumstances, passwords/passphrases are to be changed."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-8.3.10.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "8.3.10.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-8.3.10.1_smt",
                        "name": "statement",
                        "prose": "Additional requirement for service providers only: If passwords/passphrases are used as the only authentication factor for customer user access (i.e., in any single-factor authentication implementation) then either: \n* Passwords/passphrases are changed at least once every 90 days,\nOR\n\n* The security posture of accounts is dynamically analyzed, and real-time access to resources is automatically determined accordingly."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-8.3.11",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.3.11"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.3.11_smt",
                    "name": "statement",
                    "prose": "Where authentication factors such as physical or logical security tokens, smart cards, or certificates are used: \n* Factors are assigned to an individual user and not shared among multiple users. \n* Physical and/or logical controls ensure only the intended user can use that factor to gain access."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-8.4",
            "title": "Multi-factor authentication (MFA) is implemented to secure access into the CDE.",
            "props": [
              {
                "name": "label",
                "value": "8.4"
              }
            ],
            "controls": [
              {
                "id": "PCI-8.4.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.4.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.4.1_smt",
                    "name": "statement",
                    "prose": "MFA is implemented for all non-console access into the CDE for personnel with administrative access."
                  }
                ]
              },
              {
                "id": "PCI-8.4.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.4.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.4.2_smt",
                    "name": "statement",
                    "prose": "MFA is implemented for all access into the CDE."
                  }
                ]
              },
              {
                "id": "PCI-8.4.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.4.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.4.3_smt",
                    "name": "statement",
                    "prose": "MFA is implemented for all remote network access originating from outside the entity’s network that could access or impact the CDE as follows: \n* All remote access by all personnel, both users and administrators, originating from outside the entity’s network. \n* All remote access by third parties and vendors."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-8.5",
            "title": "Multi-factor authentication (MFA) systems are configured to prevent misuse.",
            "props": [
              {
                "name": "label",
                "value": "8.5"
              }
            ],
            "controls": [
              {
                "id": "PCI-8.5.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.5.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.5.1_smt",
                    "name": "statement",
                    "prose": "MFA systems are implemented as follows: \n* The MFA system is not susceptible to replay attacks. \n* MFA systems cannot be bypassed by any users, including administrative users unless specifically documented, and authorized by management on an exception basis, for a limited time period. \n* At least two different types of authentication factors are used. \n* Success of all authentication factors is required before access is granted."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-8.6",
            "title": "Use of application and system accounts and associated authentication factors is strictly managed.",
            "props": [
              {
                "name": "label",
                "value": "8.6"
              }
            ],
            "controls": [
              {
                "id": "PCI-8.6.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.6.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.6.1_smt",
                    "name": "statement",
                    "prose": "If accounts used by systems or applications can be used for interactive login, they are managed as follows: \n* Interactive use is prevented unless needed for an exceptional circumstance. \n* Interactive use is limited to the time needed for the exceptional circumstance. \n* Business justification for interactive use is documented. \n* Interactive use is explicitly approved by management. \n* Individual user identity is confirmed before access to account is granted. \n* Every action taken is attributable to an individual user."
                  }
                ]
              },
              {
                "id": "PCI-8.6.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.6.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.6.2_smt",
                    "name": "statement",
                    "prose": "Passwords/passphrases for any application and system accounts that can be used for interactive login are not hard coded in scripts, configuration/property files, or bespoke and custom source code."
                  }
                ]
              },
              {
                "id": "PCI-8.6.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "8.6.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-8.6.3_smt",
                    "name": "statement",
                    "prose": "Passwords/passphrases for any application and system accounts are protected against misuse as follows: \n* Passwords/passphrases are changed periodically (at the frequency defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1) and upon suspicion or confirmation of compromise. \n* Passwords/passphrases are constructed with sufficient complexity appropriate for how frequently the entity changes the passwords/passphrases."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-9",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "9"
          }
        ],
        "groups": [
          {
            "id": "PCI-9.1",
            "title": "Processes and mechanisms for restricting physical access to cardholder data are defined and understood.",
            "props": [
              {
                "name": "label",
                "value": "9.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-9.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.1.1_smt",
                    "name": "statement",
                    "prose": "All security policies and operational procedures that are identified in Requirement 9 are: \n* Documented. \n* Kept up to date. \n* In use. \n* Known to all affected parties."
                  }
                ]
              },
              {
                "id": "PCI-9.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.1.2_smt",
                    "name": "statement",
                    "prose": "Roles and responsibilities for performing activities in Requirement 9 are documented, assigned, and understood."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-9.2",
            "title": "Physical access controls manage entry into facilities and systems containing cardholder data.",
            "props": [
              {
                "name": "label",
                "value": "9.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-9.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.2.1_smt",
                    "name": "statement",
                    "prose": "Appropriate facility entry controls are in place to restrict physical access to systems in the CDE."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-9.2.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "9.2.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-9.2.1.1_smt",
                        "name": "statement",
                        "prose": "Individual physical access to sensitive areas within the CDE is monitored with either video cameras or physical access control mechanisms (or both) as follows: \n* Entry and exit points to/from sensitive areas within the CDE are monitored. \n* Monitoring devices or mechanisms are protected from tampering or disabling. \n* Collected data is reviewed and correlated with other entries. \n* Collected data is stored for at least three months, unless otherwise restricted by law."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-9.2.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.2.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.2.2_smt",
                    "name": "statement",
                    "prose": "Physical and/or logical controls are implemented to restrict use of publicly accessible network jacks within the facility."
                  }
                ]
              },
              {
                "id": "PCI-9.2.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.2.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.2.3_smt",
                    "name": "statement",
                    "prose": "Physical access to wireless access points, gateways, networking/communications hardware, and telecommunication lines within the facility is restricted."
                  }
                ]
              },
              {
                "id": "PCI-9.2.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.2.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.2.4_smt",
                    "name": "statement",
                    "prose": "Access to consoles in sensitive areas is restricted via locking when not in use."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-9.3",
            "title": "Physical access for personnel and visitors is authorized and managed.",
            "props": [
              {
                "name": "label",
                "value": "9.3"
              }
            ],
            "controls": [
              {
                "id": "PCI-9.3.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.3.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.3.1_smt",
                    "name": "statement",
                    "prose": "Procedures are implemented for authorizing and managing physical access of personnel to the CDE, including: \n* Identifying personnel. \n* Managing changes to an individual’s physical access requirements. \n* Revoking or terminating personnel identification. \n* Limiting access to the identification process or system to authorized personnel."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-9.3.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "9.3.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-9.3.1.1_smt",
                        "name": "statement",
                        "prose": "Physical access to sensitive areas within the CDE for personnel is controlled as follows: \n* Access is authorized and based on individual job function. \n* Access is revoked immediately upon termination. \n* All physical access mechanisms, such as keys, access cards, etc., are returned or disabled upon termination."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-9.3.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.3.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.3.2_smt",
                    "name": "statement",
                    "prose": "Procedures are implemented for authorizing and managing visitor access to the CDE, including: \n* Visitors are authorized before entering. \n* Visitors are escorted at all times. \n* Visitors are clearly identified and given a badge or other identification that expires. \n* Visitor badges or other identification visibly distinguishes visitors from personnel."
                  }
                ]
              },
              {
                "id": "PCI-9.3.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.3.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.3.3_smt",
                    "name": "statement",
                    "prose": "Visitor badges or identification are surrendered or deactivated before visitors leave the facility or at the date of expiration."
                  }
                ]
              },
              {
                "id": "PCI-9.3.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.3.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.3.4_smt",
                    "name": "statement",
                    "prose": "A visitor log is used to maintain a physical record of visitor activity within the facility and within sensitive areas, including: \n* The visitor’s name and the organization represented. \n* The date and time of the visit. \n* The name of the personnel authorizing physical access. \n* Retaining the log for at least three months, unless otherwise restricted by law."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-9.4",
            "title": "Media with cardholder data is securely stored, accessed, distributed, and destroyed.",
            "props": [
              {
                "name": "label",
                "value": "9.4"
              }
            ],
            "controls": [
              {
                "id": "PCI-9.4.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.4.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.4.1_smt",
                    "name": "statement",
                    "prose": "All media with cardholder data is physically secured."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-9.4.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "9.4.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-9.4.1.1_smt",
                        "name": "statement",
                        "prose": "Offline media backups with cardholder data are stored in a secure location."
                      }
                    ]
                  },
                  {
                    "id": "PCI-9.4.1.2",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "9.4.1.2"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-9.4.1.2_smt",
                        "name": "statement",
                        "prose": "The security of the offline media backup location(s) with cardholder data is reviewed at least once every 12 months."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-9.4.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.4.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.4.2_smt",
                    "name": "statement",
                    "prose": "All media with cardholder data is classified in accordance with the sensitivity of the data."
                  }
                ]
              },
              {
                "id": "PCI-9.4.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.4.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.4.3_smt",
                    "name": "statement",
                    "prose": "Media with cardholder data sent outside the facility is secured as follows: \n* Media sent outside the facility is logged. \n* Media is sent by secured courier or other delivery method that can be accurately tracked. \n* Offsite tracking logs include details about media location."
                  }
                ]
              },
              {
                "id": "PCI-9.4.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.4.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.4.4_smt",
                    "name": "statement",
                    "prose": "Management approves all media with cardholder data that is moved outside the facility (including when media is distributed to individuals)."
                  }
                ]
              },
              {
                "id": "PCI-9.4.5",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.4.5"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.4.5_smt",
                    "name": "statement",
                    "prose": "Inventory logs of all electronic media with cardholder data are maintained."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-9.4.5.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "9.4.5.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-9.4.5.1_smt",
                        "name": "statement",
                        "prose": "Inventories of electronic media with cardholder data are conducted at least once every 12 months."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "PCI-9.4.6",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.4.6"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.4.6_smt",
                    "name": "statement",
                    "prose": "Hard-copy materials with cardholder data are destroyed when no longer needed for business or legal reasons, as follows: \n* Materials are cross-cut shredded, incinerated, or pulped so that cardholder data cannot be reconstructed. \n* Materials are stored in secure storage containers prior to destruction."
                  }
                ]
              },
              {
                "id": "PCI-9.4.7",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.4.7"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.4.7_smt",
                    "name": "statement",
                    "prose": "Electronic media with cardholder data is destroyed when no longer needed for business or legal reasons via one of the following: \n* The electronic media is destroyed. \n* The cardholder data is rendered unrecoverable so that it cannot be reconstructed."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-9.5",
            "title": "Point-of-interaction (POI) devices are protected from tampering and unauthorized substitution.",
            "props": [
              {
                "name": "label",
                "value": "9.5"
              }
            ],
            "controls": [
              {
                "id": "PCI-9.5.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "9.5.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-9.5.1_smt",
                    "name": "statement",
                    "prose": "POI devices that capture payment card data via direct physical interaction with the payment card form factor are protected from tampering and unauthorized substitution, including the following: \n* Maintaining a list of POI devices. \n* Periodically inspecting POI devices to look for tampering or unauthorized substitution. \n* Training personnel to be aware of suspicious behavior and to report tampering or unauthorized substitution of devices."
                  }
                ],
                "controls": [
                  {
                    "id": "PCI-9.5.1.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "9.5.1.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-9.5.1.1_smt",
                        "name": "statement",
                        "prose": "An up-to-date list of POI devices is maintained, including: \n* Make and model of the device. \n* Location of device. \n* Device serial number or other methods of unique identification."
                      }
                    ]
                  },
                  {
                    "id": "PCI-9.5.1.2",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "9.5.1.2"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-9.5.1.2_smt",
                        "name": "statement",
                        "prose": "POI device surfaces are periodically inspected to detect tampering and unauthorized substitution."
                      }
                    ]
                  },
                  {
                    "id": "PCI-9.5.1.2.1",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "9.5.1.2.1"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-9.5.1.2.1_smt",
                        "name": "statement",
                        "prose": "The frequency of periodic POI device inspections and the type of inspections performed is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1."
                      }
                    ]
                  },
                  {
                    "id": "PCI-9.5.1.3",
                    "title": "",
                    "props": [
                      {
                        "name": "label",
                        "value": "9.5.1.3"
                      }
                    ],
                    "parts": [
                      {
                        "id": "PCI-9.5.1.3_smt",
                        "name": "statement",
                        "prose": "Training is provided for personnel in POI environments to be aware of attempted tampering or replacement of POI devices, and includes: \n* Verifying the identity of any third-party persons claiming to be repair or maintenance personnel, before granting them access to modify or troubleshoot devices. \n* Procedures to ensure devices are not installed, replaced, or returned without verification. \n* Being aware of suspicious behavior around devices. \n* Reporting suspicious behavior and indications of device tampering or substitution to appropriate personnel."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "PCI-A1",
        "title": "",
        "props": [
          {
            "name": "label",
            "value": "A1"
          }
        ],
        "groups": [
          {
            "id": "PCI-A1.1",
            "title": "Multi-tenant service providers protect and separate all customer environments and data.",
            "props": [
              {
                "name": "label",
                "value": "A1.1"
              }
            ],
            "controls": [
              {
                "id": "PCI-a1.1.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "a1.1.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-a1.1.1_smt",
                    "name": "statement",
                    "prose": "Logical separation is implemented as follows: \n* The provider cannot access its customers’ environments without authorization. \n* Customers cannot access the provider’s environment without authorization."
                  }
                ]
              },
              {
                "id": "PCI-a1.1.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "a1.1.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-a1.1.2_smt",
                    "name": "statement",
                    "prose": "Controls are implemented such that each customer only has permission to access its own cardholder data and CDE."
                  }
                ]
              },
              {
                "id": "PCI-a1.1.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "a1.1.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-a1.1.3_smt",
                    "name": "statement",
                    "prose": "Controls are implemented such that each customer can only access resources allocated to them."
                  }
                ]
              },
              {
                "id": "PCI-a1.1.4",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "a1.1.4"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-a1.1.4_smt",
                    "name": "statement",
                    "prose": "The effectiveness of logical separation controls used to separate customer environments is confirmed at least once every six months via penetration testing."
                  }
                ]
              }
            ]
          },
          {
            "id": "PCI-A1.2",
            "title": "Multi-tenant service providers facilitate logging and incident response for all customers.",
            "props": [
              {
                "name": "label",
                "value": "A1.2"
              }
            ],
            "controls": [
              {
                "id": "PCI-a1.2.1",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "a1.2.1"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-a1.2.1_smt",
                    "name": "statement",
                    "prose": "Audit log capability is enabled for each customer’s environment that is consistent with PCI DSS Requirement 10, including: \n* Logs are enabled for common third-party applications. \n* Logs are active by default. \n* Logs are available for review only by the owning customer. \n* Log locations are clearly communicated to the owning customer. \n* Log data and availability is consistent with PCI DSS Requirement 10."
                  }
                ]
              },
              {
                "id": "PCI-a1.2.2",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "a1.2.2"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-a1.2.2_smt",
                    "name": "statement",
                    "prose": "Processes or mechanisms are implemented to support and/or facilitate prompt forensic investigations in the event of a suspected or confirmed security incident for any customer."
                  }
                ]
              },
              {
                "id": "PCI-a1.2.3",
                "title": "",
                "props": [
                  {
                    "name": "label",
                    "value": "a1.2.3"
                  }
                ],
                "parts": [
                  {
                    "id": "PCI-a1.2.3_smt",
                    "name": "statement",
                    "prose": "Processes or mechanisms are implemented for reporting and addressing suspected or confirmed security incidents and vulnerabilities, including: \n* Customers can securely report security incidents and vulnerabilities to the provider. \n* The provider addresses and remediates suspected or confirmed security incidents and vulnerabilities according to Requirement 6.3.1."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}